{
  "Create a file in your new repository, add something to that file and commit that change with Git.": "Crea un archivo en tu nuevo repositorio, añade algo al archivo y guarda (commit) el cambio en Git.",
  "Commits": "Commits (guardar)",
  "Commits are core to using Git. They are the moments in which you save and describe the work you've done. They are the ticks in the timeline of your project's history.": "Los commits son el centro de Git. Es en ese momento, cuando haces un commit, cuando guardas y describes el trabajo que has hecho. Son los puntos en la línea del tiempo del historial de tu proyecto.",
  "Create a New File": "Crea un nuevo archivo",
  "Now that you've got a repository started let's add a file to it.": "Ahora que tienes un repositorio iniciado, agreguémosle un archivo.",
  "Open your text editor and create a new empty file. Now write a little bit of text, perhaps type {/dqm/}Hello!{/dqm/}, and save the file as 'readme.txt' in the 'hello-world' folder you created in the last challenge.": "Abre tu editor de texto y crea un nuevo archivo vacío. Ahora escribe algo de texto, por ejemplo {/dqm/}Hola!{/dqm/}, y guarda el archivo como 'readme.txt' en la carpeta 'hola-mundo' que creaste en el anterior reto.",
  "Check Status + Add and Commit Changes": "Verificar el estado + hacer commit de los cambios",
  "Next check the {/str/}status{/str_e/} of your repository to find out if there have been changes. You know you have changed something, but does Git?": "Ahore revisemos el {/str/}estado (status){/str_e/} de tu repositorio para verificar si ha habido cambios. Tú sabes que has cambiado algo, pero ¿lo sabe Git?",
  "Make sure you're still within your 'hello-world' directory when you're running these commands. Use Git to see what changed in your repository:": "Asegúrate de que aún estás en el directorio 'hola-mundo' cuando ejecutes estos comandos. Usa Git para ver qué cambió en tu repositorio:",
  "First, check the status:": "Primero, verifica el estado:",
  "Git should tell you that a file has been added.": "Git debería decirte que un archivo ha sido añadido.",
  "Then {/str/}add{/str_e/} the file you just created so that it becomes a part of the changes you will {/str/}commit{/str_e/} (aka save) with Git:": "Entonces {/str/}añade (add){/str_e/} el archivo que acabaste de crear, de forma que sea parte de los cambios que vas a {/str/}guardar (commit){/str_e/} con Git:",
  "Finally, {/str/}commit{/str_e/} those changes to the repository's history with a short (m) message describing the updates.": "Finalmente, haz {/str/}commit (guarda){/str_e/} estos cambios en el historial del repositorio con un mensaje (m) corto que describe la actualización realizada.",
  "Step: Make More Changes": "Siguiente paso: Crea más cambios",
  "Now add another line to 'readme.txt' and save the file again.": "Ahora añade otra línea a 'readme.txt' y guarda el archivo otra vez.",
  "In terminal, you can view the {/str/}diff{/str_e/}erence between the file now and how it was at your last commit.": "En la terminal, puedes ver las diferencias ({/str/}diff{/str_e/}) que hay entre el archivo ahora mismo y el archivo en el momento que creaste el último commit.",
  "Tell Git to show you the {/str/}diff{/str_e/}:": "Dile a Git que te muestre las diferencias {/str/}diff{/str_e/}:",
  "Now with what you just learned above, commit this latest change.": "Ahora con lo que aprendiste previamente, crea un commit (guarda) con el cambio más reciente.",
  "Check status of changes to a repository": "Para verificar el estado de los cambios en un repositorio",
  "View changes to files": "Ver diferencias entre las versiones (commits) de los archivos",
  "Add a file's changes to be committed": "Añadir un archivo para ser guardado (commit)",
  "To add all files changes": "Para añadir todos los archivos con cambios",
  "To commit (aka save) the changes you've added with a short message describing the changes": "Para crear un commit (guardar) los cambios que añadiste con un mensaje corto que los describe"
}
