{
  "Submit a Pull Request to the original Patchwork repository.": "Enviar una solicitud de aceptación de tus cambios (Pull Request) al repositorio original Patchwork.",
  "Pull Requests": "Pull Requests",
  "Often when you make changes and improvements to a project you've forked, you'll want to send those changes to the maintainer of the original and {/str/}request{/str_e/} that they {/str/}pull{/str_e/} those changes into the original so that everyone can benefit from the updates—that's a {/str/}pull request{/str_e/}.": "Habitualmente, cuando haces cambios y mejoras a un proyecto que has bifurcado, vas a querer enviar esos cambios a los encargados de mantener el repositorio original y {/str/}solicitarles (request){/str_e/} que {/str/}tiren (pull){/str_e/} de esos cambios al original, para que aquellos que lo usan se puedan beneficiar de las actualizaciones. Eso es un {/str/}pull request{/str_e/}.",
  "We want to add you to the list of workshop finishers, so make a {/str/}pull request{/str_e/} to add your username file to the original: {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}.": "Queremos añadirte a la lista de personas que finalizaron este taller, así que crea un {/str/}pull request{/str_e/} para añadir tu archivo con tu usuario al repositorio original: {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}.",
  "Create a pull request": "Crear un pull request",
  "Visit the original repository you forked on GitHub, in this case {/lnk_patchwork/}{/urlpatchwork/}{/lnk_e/}.": "Visita el repositorio original que bifurcaste en GitHub, en este caso {/lnk_patchwork/}{/urlpatchwork/}{/lnk_e/}.",
  "Often GitHub will detect if you've pushed a branch to a fork and display it at the top of the original's website. If you see that with your 'add-username' branch, you can click to create a Pull Request from there. If not:": "Muchas de las veces, GitHub detectará si has empujado (push) una branch a un fork y lo mostrará en la parte superior de la página del repositorio original. Si puedes ver tu rama 'add-username', puedes hacer clic en 'Create a Pull Request' (crear un pull request) desde ahí mismo. Si no:",
  "Click the green 'New pull request' button.": "Haz clic en el botón verde que dice 'New Pull Request'.",
  "Select the branch with the changes you want to submit. It should be the one with 'add-yourusername'.": "Selecciona la rama que tiene los cambios que quieres enviar. Debería ser la que se llama 'add-yourusername'.",
  "You'll now see a page with the details of the pull request you're in the process of submitting. This page shows the commits and changes, in the form of a diff, associated with your pull request as compared to the 'gh-pages' branch of the original.": "Ahora verás una página con los detalles que están en proceso de ser enviados. Esta página muestra los commits con los cambios, en el apartado diff, asociando el pull request y comparándolo con la rama 'gh-pages' del original.",
  "If the original repository has a {/str/}contribution documentation{/str_e/}, GitHub will link to it. This is documentation from repository owners on how to best make contributions to that project—very helpful to read if you'd like to see your changes adopted!": "Si el repositorio original tiene {/str/}documentación de contribución{/str_e/}, GitHub lo enlazará. Esta es la documentación en la que los propietarios del repositorio describen la que consideran la mejor manera de hacer contribuciones a ese proyecto. ¡Es de gran ayuda leer si quisieras saber si tus cambios serán aceptados!",
  "If everything on the page looks good and as you expect it:": "Si todo en la página se ve bien y es lo que esperabas:",
  "Click 'Create pull request'": "Haz clic en 'Create pull request'",
  "Add a title and description to the changes you're suggesting the original author pull in.": "Añade un título y una descripción a los cambios que has sugerido al autor del repositorio original para ser incorporados.",
  "Click 'Send pull request'!": "Haz clic en 'Send pull request'!",
  "Bingo! You submitted a pull request—take a few seconds to bask in the moment.": "¡Bingo! Enviaste un pull request — tómate unos segundos para disfrutar el momento.",
  "If all is well with your pull request, it will be merged within moments. If it's not merged automatically within a few minutes, you'll then likely have some comments from @reporobot on why it couldn't merge it. If this is the case, close your pull request on GitHub, make the necessary changes to your branch, push those changes back to your fork and reopen (this will poke @reporobot to look over it again) your pull request.": "Si todo está bien con tu pull request, será fusionado en unos momentos en este caso. Si no está automáticamente fusionado después de unos pocos minutos, entonces tendrás algunos comentarios que te hizo @reporobot explicando por qué no los pudo fusionar (merge). Si es el caso, cierra tu pull request en GitHub, haz los cambios necesarios en tu rama, vuelve a enviar los cambios a tu fork y reabre (esto avisará a @reporobot para que revise nuevamente) tu pull request."
}
