{
  "Merge your branch locally, delete the branch and pull from upstream.": "Fusiona (merge) tu rama (branch) localmente, borra la rama y tira (pull) desde upstream.",
  "Cleaning up": "Limpieza",
  "Once you don't need branches anymore you can delete them locally and remotely. This is helpful so that you don't end up with a pile of old branches.": "Una vez que ya no necesitas las ramas puedes eliminarlas local y remotamente. Esto ayuda a que no termines con una pila de ramas viejas.",
  "Merge Locally": "Fusionar (merge) localmente",
  "Your pull request has been merged! Your branch was merged into the 'gh-pages' branch of the original on GitHub. You can merge your branch locally, too.": "¡Tu pull request ha sido fusionado! Tu rama fue fusionada en la rama 'gh-pages' de el repositorio original en GitHub. Puedes fusionar la rama localmente, también.",
  "First, move into the branch you want to merge into — in this case, the branch 'gh-pages'.": "Primero, cámbiate a la rama a la cual quieres fusionarle los cambios. En este caso, la rama 'gh-pages'.",
  "Now tell Git what branch you want to merge in — in this case, your feature branch that begins with {/dqm/}add-{/dqm/}.": "Ahora dile a Git desde qué rama quieres traer los cambios. En este caso, tu rama que empieza con {/dqm/}add-{/dqm/}.",
  "Tidy up by deleting your feature branch. Now that it has been merged you don't really need it around.": "Ordena el repositorio eliminando la branch sobre la que has trabajado. Ahora que has fusionado los cambios que hiciste ahí, ya no te hace falta.",
  "You can also delete the branch from your remote on GitHub:": "También puedes eliminar la rama de tu remoto en GitHub:",
  "Pull from Upstream": "Tira (pull) desde upstream",
  "And last but not least, the original has changed since your pull request was merged — Reporobot added your name to the website! If you pull in these changes from upstream you'll be up to date and have that version too. You can actually see it live as well at: yourusername.github.io/patchwork.": "Y por último, pero no menos importante, el repositorio original ha cambiado desde que tu pull request fue fusionado, ¡añadió tu nombre al sitio web! Si tiras de esos cambios desde upstream, estarás al día y tendrás esa versión también. Puedes ver el sitio online en: tunombredeusuario.github.io/patchwork.",
  "To pull from the original upstream:": "Para tirar desde el original upstream:",
  "Congratulations!": "¡Enhorabuena!",
  "You've created local repositories, remote repositories, worked with a collaborator, pushed, pulled and joined the millions of others developing and enriching open source!": "¡Has creado repositorios, repositorios remotos, trabajado con un colaborador, empujado (push), tirado (pull) y te has unido millones de personas desarrollando y enriqueciendo el código abierto!",
  "Visit {/lnk_patchwork/}jlord.github.io/patchwork{/lnk_e/} to see your name incorporated! Looking to keep going? Checkout the {/lnk_next/}What Next{/lnk_e/} section on the resources page in this app.": "Visita {/lnk_patchwork/}jlord.github.io/patchwork{/lnk_e/} para ver tu nombre incorporado. ¿Quieres continuar? Revisa la sección {/lnk_next/}Qué más{/lnk_e/} en la página de recursos de esta aplicación.",
  "Merge a branch into current branch": "Fusiona una rama a tu rama actual",
  "Change the branch you're working on": "Cambia la rama en la que estás trabajando",
  "Delete a local branch": "Borra una rama local",
  "Delete a remote branch": "Borra una rama remota\n",
  "Pull from a remote branch": "Tira (pull) desde una rama remota"
}
