{
  "Install Git on your computer and configure your name and email.": "Installiere Git und konfiguriere deinen Namen und deine Email-Adresse.",
  "Git": "Git",
  "Git is free {/str/}open source software{/str_e/} (the {/lnk_git/}source code is public{/lnk_e/}) written by Linus Torvalds who also wrote the Linux operating system's kernel.": "Git ist eine kostenfreie {/str/}Open-Source Software{/str_e/} (der {/lnk_git/}Quellcode ist frei verfügbar{/lnk_e/}), entwickelt von Linus Torvalds, der auch den Linux Betriebssystem-Kernel geschrieben hat.",
  "Git is a program for keeping track of changes over time, known in programming as {/str/}version control{/str_e/}. If you've used a track changes feature in a text editing software then you're already familiar with the concept!": "Es handelt sich dabei um eine Software zur {/str/}Versionsverwaltung{/str_e/}, die Dateiänderungen im Verlauf der Zeit nachverfolgt und protokolliert. Wenn du schon einmal eine \"Änderungen nachverfolgen\"-Funktion in einem Textverarbeitungsprogramm verwendet hast, ist dir dieses Konzept bereits bekannt!",
  "Install Git": "Git installieren",
  "We recommend installing Git on your computer by installing the {/lnk_git/}latest version{/lnk_e/} from the Git website.": "Wir empfehlen dir die {/lnk_git/}aktuelle Version von der Git Webseite{/lnk_e/} herunterzuladen und diese auf deinem Computer zu installieren.",
  "{/str/}Windows{/str_e/}: Use the {/str/}Git Shell{/str_e/} for your terminal.": "{/str/}Windows{/str_e/}: Benutze {/str/}Git Bash{/str_e/} als Terminal.",
  "{/str/}Mac{/str_e/}: You can use the {/str/}terminal{/str_e/} app as your terminal.": "{/str/}Mac{/str_e/}: Benutze die {/str/}Terminal-App{/str_e/} als Terminal.",
  "Already have Git or not sure? Type {/cde/}git --version{/cde_e/} in your terminal and if it returns a version number higher than {/cde/}1.7.10{/cde_e/}, you're set! For more information, visit the {/lnk_git/}Git website{/lnk_e/}.": "Du hast Git schon installiert oder bist dir nicht sicher? Tippe {/cde/}git --version{/cde_e/} im Terminal ein. Wenn du in der Ausgabe eine Versions-Nummer größer als {/cde/}1.7.10{/cde_e/} siehst, ist die passende Software installiert. Weitere Informationen dazu findest du auf der {/lnk_git/}Git Webseite{/lnk_e/}.",
  "Windows Users": "Windows Nutzer",
  "On Windows, you are able to set quite a few options while installing Git. Normally, you can leave all of these options as they are set by default. However, if you have never heard of Vim as a text editor, then you might want to choose a different default editor, as Vim is relatively complex to handle. So pay a little attention to which options are set during installation.": "Bei der Installation von Git für Windows sind einige Einstellungen zur Auswahl verfügbar. Im Normalfall kannst du alle diese Einstellungen auf ihrem voreinstellten Standardwert belassen. Solltest du allerdings noch nie von Vim als Text-Editor gehört haben, ist es gegebenenfalls in deinem Interesse einen anderen Standardeditor auszuwählen, da Vim relativ komplex in der Handhabung ist. Also passe ein bisschen auf, welche Optionen während der Installation eingestellt sind.",
  "Git Software": "Git Software",
  "Git on its own isn't like other programs on your computer. You'll likely not see an icon on your desktop, but it will always be available to you and you'll be able to access it at any time from your terminal or Git desktop applications.": "Git selbst ist kein typisches Programm auf dem Computer. Für Git gibt es kein Desktop-Symbol oder eine Benutzerobefläche, aber trotzdem wird Git immer für dich verfügbar sein. Du wirst es aus dem Terminal oder durch spezielle Git-Benutzerobeflächen nutzen können.",
  "GitHub provides such an desktop application, the {/lnk_desktop/}GitHub Desktop{/lnk_e/} app. The GitHub Desktop app can do a lot of things with Git but not all, which is why learning the terminal is important. But once you've got that down, you'll be glad to have the desktop app because it organizes your project's information more visually, like the GitHub website.": "GitHub bietet eine solche Benutzerobefläche an, die {/lnk_desktop/}GitHub Desktop{/lnk_e/} App. Die GitHub Desktop App stellt zwar einen Großteil der Funktionen von Git dem Nutzer zur Verfügung, leider jedoch nicht alle Funktionen. Daher ist es wichtig, auch die Terminal-Funktionalität von Git zu kennen. Sobald du diese aber beherrschst wird dir die Desktop App eine nette Hilfe sein, da sie (wie die GitHub Webseite) deine Projekte übersichtlich darstellt.",
  "Configure Git": "Git konfigurieren",
  "Once Git is installed, open your {/str/}terminal{/str_e/}. You can verify that Git is really there by typing:": "Wenn du Git installiert hast kannst du dein {/str/}Terminal{/str_e/} öffnen. Überprüfe die Installation von Git mit dem folgenden Befehl:",
  "This will return the version of Git on your computer and look something like this:": "Dies gibt dir die Versions-Nummer deiner Git-Installation zurück und sollte in etwa so aussehen:",
  "Next, configure Git so it knows to associate your work to you:": "Nun kannst du Git so konfigurieren, dass es deine Arbeit mit dir verknüpfen kann.",
  "Set your name:": "Konfiguriere deinen Namen:",
  "Now set your email:": "Konfiguriere deine Mail-Adresse:",
  "You're done with your first challenge! Click the 'Verify' button to check the challenge.": "Damit hast du die erste Aufgabe erledigt! Klicke auf den 'Prüfen'-Button, um deine Arbeit zu kontrollieren.",
  "Dollar Signs in Code Documentation": "Dollar-Zeichen in der Code-Dokumentation",
  "Dollar signs {/cde/}${/cde_e/} are often used in programming documentation to signify that the line is {/str/}command line{/str_e/} code (see the code snippets above). You don't actually type the {/cde/}${/cde_e/} in though, only type what comes after.": "Dollar-Zeichen {/cde/}${/cde_e/} werden in Programm-Dokumentationen oft verwendet um {/str/}Kommandozeilen-Code{/str_e/} zu markieren (vgl. die Code-Schnipsel oben). Das {/cde/}${/cde_e/} wird dann nicht in die Kommandozeile übernommen, nur der darauf folgende Text wird verwendet."
}
