{
  "Connect your local repository to a remote one and push changes to it.": "Verbinde dein lokales Repository mit einem entfernten Repository und schiebe deine Änderungen dorthin.",
  "Remotes": "Remotes",
  "When you put something on GitHub that copy lives on one of GitHub's servers. This makes it a {/str/}remote{/str_e/} repository because it is not on your computer, but on a server, {/dqm/}remote{/dqm/} and somewhere else. By {/str/}pushing{/str_e/} your {/str/}local{/str_e/} (on your computer) changes to it, you keep it up to date.": "Wenn du etwas auf GitHub speicherst, liegt diese Kopie auf einem der Server von GitHub. Das macht es zu einem {/str/}Remote-{/str_e/}(dt. Fern-)Repository, da es nicht auf deinem Computer, sondern auf einem entfernten Server gespeichert ist - {/dqm/}entfernt{/dqm/} und irgendwo auf der Welt. Durch schieben (engl. {/str/}push{/str_e/}) deiner {/str/}lokalen{/str_e/} Änderungen auf den Server hältst du die Dateien auf dem Server aktuell.",
  "Others can then get the latest changes of the project by {/str/}pulling{/str_e/} your changes down from the remote (and onto their computer). This is how everyone can work on a project together without needing access to your personal computer and your locally stored copy of the project.": "Andere Nutzer können sich dann die neuesten Änderungen des Projektes vom Remote-Server ziehen (engl. {/str/}pull{/str_e/}) und auf ihrem Computer speichern. Somit können alle gemeinsam an einem Projekt arbeiten, auch ohne direkten Zugang zu deinem Computern und deiner lokalen Kopie des Projektes zu haben.",
  "The illustration shows a server (e.g. by GitHub) holding the {/str/}remote{/str_e/} repository as well as two computers, each of them holding a {/str/}local{/str_e/} copy of the repository. You can either access and edit the remote repository with your browser or edit the repository locally and tell your computer (on {/str/}terminal{/str_e/}) to talk to the server.": "Die Illustration zeigt einen Server (z.B. von GitHub) auf dem das {/str/}Remote{/str_e/} Repository gespeichert ist, sowie zwei Computer, die jeweils eine {/str/}lokale{/str_e/} Kopie des Repository speichern. Du kannst entweder mit deinem Browser auf das Remote Repository zugreifen und es bearbeiten, oder das Repository lokal bearbeiten und deinen Computer (im {/str/}Terminal{/str_e/}) anweisen mit dem Server zu kommunizieren.",
  "Create a Remote Repository": "Erstelle ein Remote Repository",
  "You want to sync your {/str/}local{/str_e/} version with one stored on GitHub.com. First create a new {/str/}remote{/str_e/} repository on GitHub.com.": "Wir möchten nun die {/str/}lokale{/str_e/} Version deines Repository mit einem Repository synchronisieren, das auf GitHub.com gespeichert ist. Dazu erstelle zuerst ein neues {/str/}Remote{/str_e/} Repository auf GitHub.com.",
  "Go to {/lnk_github/}github.com{/lnk_e/}, log in, and click the '+' in the top right and then click 'New repository'.": "Öffne {/lnk_github/}github.com{/lnk_e/} und melde dich an. Klicke auf das '+' in der rechten oberen Ecke und dann auf 'New repository'.",
  "Give it a name that matches your local repository's name, 'hello-world', and a short description.": "Gib dem neuen Repository den selben Namen, wie deinem lokalen Repository ('hello-world') und füge eine kurze Beschreibung hinzu.",
  "Make it public. This means it'll be listed on your public profile.": "Speichere das Repository als 'public' (dt. öffentlich). Das Repository wird somit auf deinem öffentlichen Profil zu sehen sein.",
  "Don't initialize with a README, because we already have a local file named 'readme.txt'. This is a helper option from GitHub if you hadn't already created it.": "Initialisiere das Repository nicht mit einer README-Datei, du hast bereits lokal eine Datei mit dem Namen 'readme.txt' gespeichert. Es handelt sich hierbei um eine Hilfsfunktion von GitHub, falls du die Datei noch nicht selbst anlegt hättest.",
  "Don't initialize with '.gitignore' or a license, we won't use them in this tutorial.": "Initialisiere nicht mit '.gitignore' oder einer Lizenz, wir werden diese im Tutorial nicht benutzen.",
  "Click create repository!": "Klicke auf 'Create repository' (dt. Repository erzeugen)!",
  "Readmes, .gitignores and Licenses": "Readme, .gitignore und Lizenzen",
  "These are common files in open source projects so to make starting a new project easier, GitHub provides an option for creating them for you.": "'README' (dt. Liesmich), '.gitignore' (dt. .gitignorieren) und Lizenzdateien sind übliche Dateien in einem Open-Source Projekt. Um den Projektstart etwas einfacher zu machen stellt GitHub daher die Möglichkeit bereit, diese Dateien für dich zu erzeugen.",
  "A {/str/}readme{/str_e/} explains what the project is, how to use it, and often times, how to contribute (though sometimes there is an extra file, 'CONTRIBUTING.md', for those details).": "Eine {/str/}README{/str_e/}-Datei erklärt üblicherweise das Projekt, wie es zu nutzen ist und oft auch wie man zum Projekt beitragen kann. (Letztere Infos werden manchmal auch in einer extra Datei 'CONTRIBUTING.md' (dt. beitragen) bereitgestellt.)",
  "A {/str/}.gitignore{/str_e/} is a list of files that Git should {/em/}not{/em_e/} track, for instance, files with passwords!": "Die Datei {/str/}.gitignore{/str_e/} enthält eine Liste der Dateien, die Git {/em/}nicht{/em_e/} nachverfolgen soll, was z.B. für Dateien mit Passwörtern sehr nützlich ist.",
  "A {/str/}license{/str_e/} file is the type of license you put on your project. This lets others know how they can use it. Information on the types is here: {/lnk_license/}choosealicense.com{/lnk_e/}.": "Eine {/str/}Lizenz{/str_e/}-Datei bestimmt die Lizenz unter der dein Projekt steht. Andere können daraus erfahren, unter welchen Bedingungen sie das Projekt nutzen und weiterverbreiten dürfen. Informationen zu den verschiedenen Lizenztypen findest du z.B. hier (engl.): {/lnk_license/}choosealicense.com{/lnk_e/}.",
  "Connect your Local to your Remote": "Verbinde das lokale Repository mit dem Remote-Repository",
  "Now you've got an empty repository started on GitHub.com. At the top you'll see the section 'Quick Setup'. Make sure the 'HTTPS' button is selected and copy the address. This is the address of your repository on GitHub's servers.": "Du hast nun ein leeres Repository auf GitHub.com erstellt. Im oberen Teil der Seite solltest du nun den Abschnitt 'Quick Setup' (dt. Schnelleinrichtung) sehen. Stelle sicher, dass 'HTTPS' ausgewählt ist und kopiere dann die angezeigte Adresse. Dies ist die Adresse deines Repository auf dem GitHub-Server.",
  "Back in your terminal, and inside of the 'hello-world' folder that you initialized as a Git repository, you want to tell Git to remember the address of the remote version on GitHub's servers. You can have multiple remotes so each requires a unique name. The primary remote is typically named {/cde/}origin{/cde_e/}.": "Zurück im Terminal und in deinem 'hello-world' Verzeichnis (das du schon als lokales Git Repository initialisiert hast) willst du Git nun die Adresse des zu verknüpfenden Remote-Repository auf dem GitHub Server mitteilen. Da es möglich ist mehrere Remotes zu verknüpfen, müssen diese eindeutig benannt werden. Das primäre Remote-Repository wird dabei meist als {/cde/}origin{/cde_e/} (dt. Ursprung) benannt.",
  "To add a remote named 'origin' to your repository:": "Um ein Remote mit dem Namen 'origin' zu deinem Repository hinzuzufügen:",
  "Your {/str/}local{/str_e/} repository now knows where your {/str/}remote{/str_e/} repository, named 'origin', lives on GitHub's servers. Think of it as adding a name and address on speed dial—now when you need to send something there, you can.": "Dein {/str/}lokales{/str_e/} Repository weiß nun, wo dein {/str/}Remote{/str_e/}-Repository mit dem Namen 'origin' auf dem GitHub-Server gespeichert ist. Dies kannst du dir vorstellen, wie einen Namen und eine Adresse zur Kurzwahl im Telefon hinzuzufügen. Du kannst nun deine Änderungen dort hinschieben.",
  "Personal Access Tokens": "Persönliche Zugriffstoken",
  "On the next step you will need to authenticate yourself towards GitHub. GitHub does not accept simple passwords for this, but requires to use a {/str/}Personal Access Token (PAT){/str_e/}. This might feel a bit cumbersome but is meant to be a security feature. Access-tokens are like strong passwords that can be scoped, be set to expire or also just be deactivated manually once compromised.": "Im nächsten Schritt wirst du dich gegenüber GitHub authentifizieren müssen. GitHub akzeptiert hierbei keine einfachen Passwörter mehr, sondern verlangt die Nutzung eines Persönlichen Zugriffstoken ({/str/}'Personal Access Token', PAT{/str_e/}). Dies mag sich etwas umständlich anfühlen, ist aber als Sicherheits-Feature gedacht. Zugriffstoken sind wie starke Passwörter, die aber auf bestimmte Tätigkeiten eingeschränkt werden, ein Ablaufdatum bekommen oder auch manuell wieder deaktiviert werden können, falls sie kompromittiert wurden.",
  "Depending on your git installation there might be alternative methods for authentication available (e.g. via Browser). If not, you will need to create a PAT and use this one as your password, when prompted.": "Abhängig von deiner Git Installation könnten auch weitere Möglichkeiten zur Authentifizierung verfügbar sein (z.B. via Browser). Falls nicht, wirst du aber einen persönlichen Zugriffstoken erzeugen müssen, den du dann als Passwort verwendest, wenn du danach gefragt wirst.",
  "To generate a new Personal Access Token:": "Um einen persönlichen Zugriffstoken zu erzeugen:",
  "Open {/lnk_pat/}Github - Personal access tokens{/lnk_e/} and click on 'Generate new token'. For now, choose the 'classic' way of generating the token.": "Öffne {/lnk_pat/}GitHub - Personal Access Tokens {/lnk_e/} und klicke auf 'Generate new token' (dt. 'Neuen Token erzeugen'). Verwende für nun den klassischen ('classic') Weg, den Token zu erzeugen.",
  "Add a note to identify your token.": "Füge eine Notiz hinzu, um den Token zu identifizieren.",
  "Best set some expiration.": "Setze idealerweise ein Ablaufdatum.",
  "Select the scope {/cde/}public_repo{/cde_e/}. This suffices for what we will be doing here.": "Wähle den Geltungsbereich ('scope') {/cde/}public_repo{/cde_e/} aus. Dies reicht aus, für was wir hier tun werden.",
  "Generate the token, then copy and store it in a safe location. Keep in mind it should be handled like a password.": "Erzeuge den Token, kopiere und speichere ihn an einem sicheren Ort. Denke daran, er sollte wie ein Passwort behandelt werden.",
  "Use it when beeing asked for a password.": "Verwende ihn, wenn du nach einem Passwort gefragt wirst.",
  "Push Work to your Remote": "Schiebe deine Arbeit zum Remote",
  "Next you want to {/str/}push{/str_e/} (send) everything you've done locally to your remote repository on GitHub. This is something you'll do often so that your remote version is up to date and matching the state of your local version.": "Nun möchtest du alle Änderungen, die du lokal gemacht hast, zu deinem Remote-Repository bei GitHub schieben (engl. {/str/}push{/str_e/}). Dies ist eine Funktion, die du sehr oft nutzen wirst um die Remote-Version des Repository aktuell zu halten.",
  "Git has a branching system so that you can work on different parts of a project at different times. We'll learn more about that later, but our first branch is named 'main'. When you push (and later pull) from a project, you tell Git the {/str/}branch name{/str_e/} you want and the name of the {/str/}remote{/str_e/} that it lives on.": "Git bietet ein Verzweigungs-System, mit dem es möglich ist an verschiedenen Teilen des Projektes parallel zu arbeiten. Wir werden später mehr darüber lernen, aber unser erster Branch (dt. Ast) wurde mit dem Namen 'main' bezeichnet. Wenn du aus einem Projekt heraus Dateien auf den Server schiebst (und später auch von dort ziehst), musst du Git den {/str/}Branch-Namen{/str_e/} nennen, in den du schieben möchtest, sowie den zugehörigen {/str/}Remote{/str_e/}, auf dem es gespeichert ist.",
  "In this case, we'll send our branch named 'main' to our remote on GitHub named 'origin'.": "In diesem Fall senden wir unseren Branch 'main' zum erstellten Remote auf GitHub mit dem Namen 'origin'.",
  "Now go to your remote repository's page on GitHub.com and refresh the page. {/str/}Wow!{/str_e/} Everything is now the same locally as it is remotely. Congrats on your first public repository!": "Gehe nun zurück zu deinem Remote-Repository auf GitHub.com und aktualisiere die Seite. {/str/}Wow!{/str_e/} Online sind nun die selben Daten verfügbar, wie in deinem lokalen Verzeichnis. Gratulation zu deinem ersten öffentlichen Repository!",
  "Add remote connections": "Füge Remote-Verbindungen hinzu",
  "Set a URL to a remote": "Speichere die URL zu einem existierenden Remote",
  "Push changes": "Schiebe Änderungen auf den Server",
  "View remote addresses": "Zeige die gespeicherten Remote-Adressen an"
}
