{
  "Fork a project from GitHub.com and clone it locally.": "Spalte auf GitHub ein Projekt ab und klone es auf deinen Computer.",
  "Forks": "Forks - Abspaltungen",
  "So far you have made a project locally and pushed it to GitHub, but that's only half the fun! The other half is working with other people and other projects.": "Bisher hast du ein Projekt lokal neu erstellt und es dann zu GitHub geschoben. Aber das ist nur der halbe Spaß! Die andere Hälfte ist an fremden Projekten mitarbeiten zu können!",
  "When you {/str/}fork{/str_e/} a repository, you create a copy of it on your GitHub account. Your forked copy begins its own life as a {/str/}remote{/str_e/} repository. Forks are used for creating your own version of a project and - if desired - for contributing your changes back to the original project (such as bug fixes or new features).": "Wenn du ein Repository abspaltest (engl. to {/str/}fork{/str_e/}), erzeugst du eine Kopie des Projektes in deinem GitHub Account. Die abgespaltete Kopie beginnt somit ihr eigenes Leben als {/str/}Remote{/str_e/}-Repository. Forks (dt. Abspaltungen) werden verwendet um eigene Versionen eines Projektes zu erstellen und dann - wenn gewünscht - um von dort Änderungen wieder zum originalen Projekt beizutragen (wie z.B. Fehlerkorrekturen oder neue Funktionen).",
  "To get a forked repository from your GitHub account onto your computer you {/str/}clone{/str_e/} it. This cloning action copies the remote repository onto your computer so that you can work on it locally.": "Um ein abgespaltetes Projekt aus deinem GitHub Account auf deinen Computer zu bekommen, wird es {/str/}geklont{/str_e/}. Dieses Klonen kopiert das gesamte Remote-Repository auf deinen Computer, damit du dann lokal daran arbeiten kannst.",
  "By {/str/}forking{/str_e/} a foreign repository, you create a copy of the project as a new {/str/}remote{/str_e/} repository on your own GitHub Account. After {/str/}cloning{/str_e/} this new repository to your computer, you can work on it, {/str/}push{/str_e/} your changes to the server and even {/str/}pull{/str_e/} other peoples changes to your local copy. You can of course pull changes from the original repository too, but - as long as you don't have write-access - you can not push your changes there. We'll learn more on pulling later on.": "Durch {/str/}abspalten{/str_e/} von einem fremden Repository, erstellst du eine Kopie des Projektes als neues {/str/}Remote{/str_e/} Repository in deinem GitHub Account. Nachdem du dieses Repository auf deinen Computer geklont (engl. to {/str/}clone{/str_e/}) hast, kannst du daran arbeiten, deine Änderungen auf den Server schieben (engl. to {/str/}push{/str_e/}), aber auch die Änderungen anderer Personen in deine lokale Kopie ziehen (engl. to {/str/}pull{/str_e/}). Du kannst natürlich auch Änderungen aus dem originalen Repository zu dir ziehen, aber - so lange du keinen Schreibzugriff hast - deine Änderungen nicht zum originalen Repository schieben. Das ziehen von Änderungen werden wir uns später genauer anschauen.",
  "Fork the Patchwork Repository": "Spalte das Patchwork Repository ab",
  "The project we'll work with is at {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. Go to that page and click the 'Fork' button at the top right. Then create the fork. Once the forking animation is complete, you have a copy on your account. Copy your fork's HTTP URL from the address bar in your browser, this is the address of your fork on GitHub's servers.": "Das Projekt mit dem wir arbeiten werden ist unter {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/} zu finden. Öffne die Seite und klicke auf den 'Fork'-Button in der rechten oberen Ecke. Dann erzeuge den Fork. Sobald die Animation fertig ist, hast du eine Kopie des Repository in deinem Account gespeichert. Kopiere nun die URL aus der Adresszeile deines Browsers. Das ist die Adresse deines Forks auf dem GitHub-Server.",
  "Clone Your Fork Locally": "Klone das abgespaltete Repository auf deinen Computer",
  "Now, in terminal, you'll clone the repository onto your computer. It will automatically create a new folder for the repository so there is no need to create one yourself. But make sure you aren't cloning it inside of another Git repository folder!": "Im Terminal wirst du das Repository jetzt auf deinen Computer klonen. Git erzeugt dabei automatisch einen neuen Ordner für das Repository, wir müssen also kein Verzeichnis extra erstellen. Stelle aber sicher, dass du nicht in das Verzeichnis eines anderen Git-Repository hinein klonst!",
  "So be sure you're not inside of the 'hello-world' directory from the previous challenges. To back out and leave this folder so that you can clone, follow these steps:": "Versichere dich also, dass du dich nicht innerhalb deines 'hello-world' Verzeichnisses aus den vorherigen Aufgaben befindest. Um das 'hello-world' Verzeichnis zu verlassen und das abgespaltete Repository zu klonen, führe die folgenden Schritte aus:",
  "Back out of your 'hello-world' folder:": "Verlasse deinen 'hello-world' Ordner:",
  "Tip: the two dots mean step out of a directory one level": "Tipp: Die beiden Punkte bezeichnen das Verlassen des aktuellen Verzeichnisses um eine Ebene.",
  "Now that you're no longer in another Git repository, clone your fork:": "Da du dich jetzt nicht mehr innerhalb eines anderen Git-Repository befindest, klone dein Repository:",
  "Go into the folder it created for your local copy of the fork (in this case, named 'patchwork').": "Öffne den Ordner, der für deine lokale Kopie des Repository erzeugt wurde (in diesem Fall der Ordner 'patchwork').",
  "Now you've got a copy of the repository on your computer and it is automatically connected to the remote repository (your forked copy) on your GitHub account. Type {/cde/}git remote -v{/cde_e/} to see that the address to the fork is already set up.": "Du hast jetzt eine lokale Kopie des Repository auf deinem Copmuter, welches automatisch mit dem Remote-Repository in deinem GitHub-Account (die abgespaltete Kopie) verbunden ist. Gib {/cde/}git remote -v{/cde_e/} ein, um zu sehen, dass die Adresse zum Remote-Repository bereits gespeichert ist.",
  "Connect to the Original Repository": "Verbinde dein Repository mit dem originalen Repository",
  "What if the original repository you forked happens to change? You'll want to be able to {/str/}pull{/str_e/} in those changes too. So let's add another remote connection, this time to the original, {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}, repository with its URL.": "Was passiert, wenn sich nun das originale Repository verändert? Du wirst dir die Möglichkeit wünschen, diese Änderungen auch in dein abgespaltetes Repository {/str/}ziehen{/str_e/} zu können. Hierfür fügen wir nun noch eine weitere Remote-Verbindung hinzu, diesmal zum originalen {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/} Repository mit der passenden URL.",
  "You can name this remote connection anything you want, but typically people use the name 'upstream'{/smc/}. So let's use that for now.": "Du kannst diese Remote-Verbindung theoretisch frei benennen, üblicherweiße verwendet man hierfür aber den Begriff 'upstream' (dt. stromaufwärts){/smc/} Wir werden diesen Begriff auch hier verwenden.",
  "To be sure you have the correct remotes set up, type {/cde/}git remote -v{/cde_e/} to list out the addresses you have stored. {/str/}You should have an 'origin' remote with your fork's address and then an 'upstream' remote with the address to the original repository and the URL noted above in this step.{/str_e/}": "Um sicherzustellen, dass die Remotes richtig eingestellt sind, gib das Kommando {/cde/}git remote -v{/cde_e/} ein, um eine Liste der gespeicherten Adressen angezeigt zu bekommen. {/str/}Du solltest einen 'origin'-Remote mit der Adresse deines Fork, sowie einen 'upstream'-Remote mit der oben genannten Adresse des originalen Repository besitzen.{/str_e/}",
  "Add a remote": "Füge ein Remote hinzu",
  "Change a remote URL": "Ändere die URL eines Remote",
  "View remote connections": "Liste die gespeicherten Remote-Verbindungen auf"
}
