{
  "Add a collaborator to your project.": "Füge einen Mitarbeiter zu deinem Projekt hinzu.",
  "Social Coding": "Soziales Programmieren",
  "Working with others is one of the best things about GitHub because it is easier to work from any place or timezone with someone else.": "Mit anderen Nutzern zusammenarbeiten zu können ist eines der besten Features von GitHub. Personen aus unterschiedlichsten Orten und Zeitzonen können hier gemeinsam an einem Projekt arbeiten.",
  "{/str/}Collaborators{/str_e/} are other GitHub users who are given permission to make edits to a repository owned by someone else. You may also hear the term {/str/}contributor{/str_e/}, this describes another GitHub user who has made contributions, through a Fork and Pull Request, to a project.": "{/str/}Collaborators{/str_e/} (dt. Mitarbeiter) sind GitHub-Nutzer, denen es erlaubt wird im Repository eines anderen Nutzers Änderungen vorzunehmen. Auch der Begriff {/str/}contributor{/str_e/} (dt. Mitwirkender) taucht immer wieder auf. Dies beschreibt einen GitHub-Nutzer, der durch einen Fork und Pull-Request (s. Aufgabe 10) zum Projekt beigetragen hat.",
  "{/lnk_reporobot/}@reporobot{/lnk_e/} is a robot from outer space that loves collaborating on repos.": "{/lnk_reporobot/}@reporobot{/lnk_e/} ist ein Roboter aus dem All, der sehr gerne an Repositorys mitarbeitet.",
  "Hello, Repo Robot!": "Herzlich Willkommen, RepoRobot!",
  "To add collaborators to one of your projects, visit the repository's page on your GitHub account and click the 'Settings' tab in the menu in the upper part of the page. Then select the 'Collaborators' option and click on 'Add people'. Type the username into the text box, select the right user and finally add the collaborator to your repository by clicking the green button.": "Um einen Mitarbeiter zu deinem Projekt hinzuzufügen, öffne die Repository-Seite in deinem GitHub-Account und klicke auf den Einstellungs-Button ('Settings') im oberen Menü der Seite. Wähle die Option 'Collaborators' aus und klicke auf 'Add People' (dt. 'Menschen hinzufügen'). Tippe den Nutzernamen in die Textbox ein, wähle den richtigen Nutzer aus und füge den Mitarbeiter schließlich zu deinem Repository hinzu, indem du auf das grüne Feld klickst.",
  "{/str/}Now go to your forked Patchwork repository's page on GitHub and add 'RepoRobot' as a collaborator.{/str_e/} The URL should look like this, but with your own username.": "{/str/}Öffne nun die Seite deines abgespalteten Patchwork-Repository auf GitHub und füge 'RepoRobot' als Mitarbeiter hinzu.{/str_e/} Die URL sollte in etwa so aussehen, entsprechend mit deinem eigenen Nutzernamen:"
}
