{
  "Keep your file up to date by pulling in changes from collaborators.": "Halte deine lokalen Dateien aktuell, indem du die Änderungen von Mitarbeitern zu dir ziehst.",
  "Pulling from a Remote": "Von einem Remote ziehen",
  "If you're working on something with someone else you need to stay up to date with the latest changes. So you'll want to {/str/}pull{/str_e/} in any changes that may have been pushed to the central GitHub repository.": "Wenn du mit Anderen gemeinsam an einem Projekt arbeitest, sollten deine Dateien natürlich immer mit allen Änderungen synchron bleiben. Änderungen, die auf dem zentralen GitHub-Repository gemacht wurden solltest du dir also regelmäßig in dein lokales Repository ziehen (engl. {/str/}pull{/str_e/}).",
  "If someone else {/str/}pushed{/str_e/} changes to the {/str/}remote{/str_e/} repository (on GitHub), you might want to {/str/}pull{/str_e/} these changes into your {/str/}local{/str_e/} repository.": "Wenn eine andere Person Änderungen zum {/str/}Remote{/str_e/}-Repository (bei GitHub) geschoben hat (engl. {/str/}push{/str_e/}), möchtest du diese Änderungen wahrscheinlich in dein {/str/}lokales{/str_e/} Repository ziehen (engl. {/str/}pull{/str_e/}).",
  "What has Reporobot been up to?": "Was hat Reporobot vor?",
  "See if Reporobot has made any changes to your branch by pulling in any changes from the remote named 'origin' on GitHub:": "Sieh nach, ob Reporobot in deinem Branch etwas geändert hat, indem du die Änderungen vom Remote 'origin' (bei GitHub) auf deinen Computer ziehst:",
  "If nothing's changed, it will tell you 'Already up-to-date'. If there are changes, Git will merge those changes into your local version.": "Wenn sich nichts geändert hat, wird Git dir 'Already up-to-date' (dt. bereits aktuell) zurückgeben. Falls aber etwas geändert wurde, pflegt Git diese Änderungen automatisch in deine lokale Version ein.",
  "Did Reporobot make changes? Git tells you where changes were made. You can open that file and see Reporobot's updates. Surprise, Reporobot is an artist!": "Hat Reporobot etwas geändert? Git sagt dir, wo Änderungen erfolgt sind. Du kannst die Datei öffnen und Reporobot's Änderungen anschauen. Überraschung, Reporobot ist ein Künstler!",
  "Check Git status": "Prüfe den Git Status",
  "Pull in changes from a remote branch": "Ziehe Änderungen von einem Remote Branch",
  "See changes to the remote before you pull in": "Schaue dir die Änderungen an, bevor du sie vom Remote ziehst"
}
