{
  "Submit a Pull Request to the original Patchwork repository.": "Reiche ein Pull-Request in das originale Patchwork Repository ein.",
  "Pull Requests": "Pull-Requests",
  "Often when you make changes and improvements to a project you've forked, you'll want to send those changes to the maintainer of the original and {/str/}request{/str_e/} that they {/str/}pull{/str_e/} those changes into the original so that everyone can benefit from the updates—that's a {/str/}pull request{/str_e/}.": "Wenn Du Änderungen oder Verbesserungen an einem abgespalteten Projekt gemacht hast, möchtest du diese Änderungen meist auch an das originale Projekt senden, damit alle davon profitieren können. Dazu fragst du beim Projekt an (engl. {/str/}request{/str_e/}), dass deine Änderungen in das Original-Repository gezogen werden (engl. {/str/}pull{/str_e/}) - Diese Anfrage ist ein {/str/}Pull-Request{/str_e/}.",
  "We want to add you to the list of workshop finishers, so make a {/str/}pull request{/str_e/} to add your username file to the original: {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}.": "Wir möchten dich nun zur Liste der fertigen Workshop-Teilnehmer hinzufügen. Erstelle also ein {/str/}Pull-Request{/str_e/}, um die Datei mit deinem Nutzernamen zum originalen Repository ({/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}) hinzuzufügen.",
  "Create a pull request": "Erstelle ein Pull-Request",
  "Visit the original repository you forked on GitHub, in this case {/lnk_patchwork/}{/urlpatchwork/}{/lnk_e/}.": "Öffne die Webseite des originalen Repository auf Github, von dem du dein Projekt abgespalten hast. In unserem Fall ist dies {/lnk_patchwork/}{/urlpatchwork/}{/lnk_e/}.",
  "Often GitHub will detect if you've pushed a branch to a fork and display it at the top of the original's website. If you see that with your 'add-username' branch, you can click to create a Pull Request from there. If not:": "Oft erkennt GitHub bereits, wenn du einen neuen Branch in dein abgespaltetes Repository geschoben hast und zeigt dir dies im oberen Teil der Webseite des originalen Repository an. Wenn du dies mit deinem Branch 'add-username' siehst, kannst du dort direkt ein Pull-Request zu erzeugen. Falls nicht:",
  "Click the green 'New pull request' button.": "Klicke auf den grünen Button 'New pull request' (dt. neuer Pull-Request).",
  "Select the branch with the changes you want to submit. It should be the one with 'add-yourusername'.": "Wähle den Branch mit den Änderungen aus, die du hinzufügen willst. In unserem Fall sollte dies der Branch 'add-username' sein.",
  "You'll now see a page with the details of the pull request you're in the process of submitting. This page shows the commits and changes, in the form of a diff, associated with your pull request as compared to the 'gh-pages' branch of the original.": "Du siehst nun eine Seite mit den Details des Pull-Request, den du erstellen möchtest. Die Seite zeigt dir die Commits und die jeweiligen Änderungen an - in Form eines Vergleiches zum ausgewählten 'gh-pages'-Branch des Original-Repositorys.",
  "If the original repository has a {/str/}contribution documentation{/str_e/}, GitHub will link to it. This is documentation from repository owners on how to best make contributions to that project—very helpful to read if you'd like to see your changes adopted!": "Wenn das Original-Repository eine Beitragsdokumentation (engl. {/str/}contribution documentation{/str_e/}) besitzt, wird GitHub darauf verweißen. Das ist die Dokumentation des Repository-Besitzers, wie zum Projekt beigetragen werden kann. Oft ist es sehr nützlich diese (im Vorraus) zu lesen, damit Änderungen akzeptiert werden!",
  "If everything on the page looks good and as you expect it:": "Wenn auf dieser Seite alles gut - und so, wie erwartet - aussieht:",
  "Click 'Create pull request'": "Klicke auf 'Create pull request' (dt. Pull-Request erstellen)",
  "Add a title and description to the changes you're suggesting the original author pull in.": "Füge einen Titel und eine Beschreibung der Änderungen hinzu, die du dem Autor des orignalen Repository vorschlägst.",
  "Click 'Send pull request'!": "Klicke auf 'Send pull request' (dt. Pull-Request absenden)!",
  "Bingo! You submitted a pull request—take a few seconds to bask in the moment.": "Bingo! Du hast ein Pull-Request eingereicht. - Nimm dir ein paar Sekunden Zeit, um den Moment zu genießen.",
  "If all is well with your pull request, it will be merged within moments. If it's not merged automatically within a few minutes, you'll then likely have some comments from @reporobot on why it couldn't merge it. If this is the case, close your pull request on GitHub, make the necessary changes to your branch, push those changes back to your fork and reopen (this will poke @reporobot to look over it again) your pull request.": "Wenn mit deinem Pull-Request alles in Ordnung ist, sollte er in Kürze akzeptiert werden. Falls er nicht innerhalb von ein paar Minuten akzeptiert wird, hast du wahrscheinlich einen Kommentar von @reporobot bekommen, mit der Info, warum er die Änderungen nicht akzeptieren konnte. Sollte dies der Fall sein, schließe dein Pull-Request auf GitHub, ändere die nötigen Dinge in deinem Branch, schiebe diese Änderungen in dein abgespaltenes Repository und öffne deinen Pull-Request dann erneut. @reporobot wird es sich dann nocheinmal anschauen."
}
