{
  "Create a new repository on your computer.": "ڕیپۆیەکی نوێ درووست بکە لەسەر کۆمپیوتەرەکەت.",
  "Repositories": "ڕیپۆکان",
  "A {/str/}repository{/str_e/} is a collection of related items. In our case, when writing software, it is a collection of files related to a software project. You can imagine it as a project folder with all the relevant files inside of it. In fact, that's what it will look like on your computer anyways. Sometimes they're called 'repos' for short.": "{/str/}repository{/str_e/} کۆمەڵێک دانەی پەیوەندیدارن. لەم دۆخەی ئێمەدا، کە نەرمەکاڵایەک ئەنوسین، کۆمەڵێ پەڕگەی پەیوەندیدارە بە پڕۆژەی نەرمەکاڵاکەوە. ئەتوانی وا خەیاڵی بکەیت کە بوخچەیەکە لەگەڵ هەموو پەڕگە پەیوەندیدارەکانی لە ناویدایە. لە ڕاستیدا، هەر بەوجۆرە دەردەکەوێ لەسەر کۆمپیوتەرەکەت بەهەرحاڵ. ووشە ئینگلیزیەکە کورت دەکرێتەوە بۆ 'Repo'. ",
  "You tell Git what your project is and Git will start tracking all of the changes to that folder. This makes it a Git repository: a folder of items being tracked by Git. Git tracks when files are added, subtracted or even a single letter in a single file is changed. All of this plus who did it and when is tracked by Git. In software, tracking changes like this is called {/str/}version control{/str_e/}.": "تۆ بە گیت ئەڵێی پڕۆژەکەت چییە و گیت دەست ئەکا بە چاودێری کردنی هەموو گۆڕانکارییەکان لەو بوخچەیەدا. ئەمە ئەیکا بە ڕیپۆیەکی گیت: بوخچەیەک دانەی پەیوەندیدار کە لەلایەن Gitـەوە چاودێری دەکرێت. گیت چاودێری ئەوە ئەکات کە پەڕگەیەک زیادبکرێ، لاببرێت، یان یەک پیت لەو پەڕگەیەدا بگۆڕێ. هەموو ئەمانەو هەروەها کێ ئەو گۆڕانکارییەی کردووە و کەی کردوویەتی چاودێری ئەکرێ لەلایەن Gitـەوە. لە نەرمەکاڵادا، چاودێری کردنی گۆڕانکارییەکان وەک ئەمە پێی دەوترێت {/str/}کۆنترۆڵکردنی وەشان{/str_e/}. ",
  "Using Terminal": "بەکارهێنانی تێرمیناڵ",
  "{/str/}Terminal{/str_e/} (or Bash) is a way to instruct your computer to do things by typing commands rather than clicking applications with your mouse. You can rename files, open files, create new folders, move between directories (folders) and more all by running typed commands. You can even use a text editor for code (like {/lnk_vim/}Vim{/lnk_e/}) in your terminal an never have to leave!": "{/str/}Terminal{/str_e/} (یان Bash) ڕێگایەکە بۆ ڕێنمایی کردنی کۆمپیوتەرەکەت کە شتگەلێک ئەنجام بدات لە ڕێی نوسینی فرمانەکانەوە لەجیاتی کرتەکردن لەسەر ئەپەکان بە مشکی کۆمپیوتەرەکەت. ئەتوانی ناوی پەڕگەکان بگۆڕیت، پەڕگەکان بکەیتەوە، بوخچەی نوێ دروست بکەیت، لە بوخچەیەکەوە (folders) بچیتە بوخچەیەکی دیکە و زۆری تر،بە جێبەجێ کردنی فرمانە نووسراوەکان. تەنانەت دەتوانی دەستکاریکەرێکی دەقی بەکاربهێنی بۆ کۆد نووسین (وەک {/lnk_vim/}Vim{/lnk_e/}) لە ناو تێرمیناڵەکەت هیچی دیکە بەکارنەهێنی.",
  "Besides navigating your computer, you can also use programs in Terminal that have a {/str/}command-line interface (CLI){/str_e/}, meaning they can be run with commands in terminal. Git is one of these. The first part of the command lets your computer know you're talking to Git. The parts following that are the commands and the different options you want Git to act on.": "لەپاڵ هاتن و چوون لە کۆمپیوتەرەکەتدا، ئەتوانی نەرمەکاڵاکان بەکاربهێنیت کە خاوەنی {/str/}command-line interface (CLI){/str_e/} واتە دەتوانی جێبەجێیان بکەیت لەڕێگەی فرمانەوە لە تێرمیناڵدا. Git یەکێکە لەوان. یەکەم بەشی ئەو فرمانانە لێدەگەڕێ کە کۆمپیوتەرەکەت بزانێ تۆ قسە لەگەڵ Git ئەکەیت. بەشی دوای ئەو ئەو فرمان و هەڵبژاردە جیاوازانەن کە دەتەوێ Git بەپێی ئەوانە هەڵسوکەوت بکات.",
  "In Git-it you'll learn a few basic command-line actions (in addition to Git commands) for navigating your computer. They're described within the steps.": "لە Git-it دا، چەند کردارێکی سادەی command-line فێردەبی ( لەگەڵ فرمانەکانی Gitـدا) بۆ هاتن و چون لە کۆمپیوتەرەکەتدا. لە هەنگاوەکاندا باسیان کراوە.",
  "Create a Repository": "ڕیپۆیەک دروست بکە",
  "You're going to create a new project folder and then initialize it as a Git repository. We'll name the folder 'hello-world' in this challenge, but you can choose a different name if you already have a folder named this (it's a common first project name).": "بوخچەی پڕۆژەیەکی نوێ دروست دەکەیت و پاشان نیشانە \"initialize\"ـی دەکەیت وەک ڕیپۆیەکی Git. ناوی بوخچەکە ئەنێین 'hello-world' لەم ئەرکەدا، بەڵام تۆ ئەتوانی هەر ناوێکی دیکە هەڵبژێریت ئەگەر بوخچەیەکت هەیە بەو ناوەوە (ناوێکی باوە بۆ یەکەم پڕۆژە)",
  "Time to open your terminal!": "کاتی ئەوەیە تێرمیناڵەکەت بکەیتەوە!",
  "In your terminal window, type these commands, one at a time, pressing enter/return after each.": "لە پەنجەرەی تێرمیناڵەکەتدا، ئەم فرمانانە بنووسە، هەر جارەو دانەیەکیان، لە دوای هەر یەکەیان enter/return دابگرە.",
  "First, make a new folder:": "یەکەم شت، بوخچەیەکی نوێ دروست بکە:",
  "Tip: mkdir stands for {/em/}make directory{/em_e/}": "زانیاری: mkdir بەمانای {/em/}بوخچە دروست بکە{/em_e/} دێت",
  "Then go into that folder:": "پاشان بڕۆ ناو ئەو بوخچەیە:",
  "Tip: cd stands for {/em/}change directory{/em_e/}": "زانیاری: cd بەمانای {/em/}بوخچە بگۆڕ{/em_e/} دێت",
  "Finally, tell Git to initialize (start tracking) the folder you are now in:": "لە کۆتاییدا، بە Git بلێ کە ئەو بوخچەیەی ئێستا لە ناویدای نیشانە \"initialize\" بکات (دەست بکات بە چاودێری):",
  "The last command should return something starting with 'Initialized empty Git repository'. The others commands do not return anything.": "کۆتا فرمان پێویستە شتێک بگەڕێنێتەوە کە دەستپێدەکا بە 'Initialized empty Git repository'. فرمانەکانی دیکە هیچ شتێک ناگەڕێننەوە.",
  "You did it! If you want to be double-sure that it's a Git repository, type {/cde/}git status{/cde_e/} and if it doesn't return 'fatal: Not a git repository...', you're golden!": "ئەنجامت دا! ئەگەر ئەتوێ دووبارە دڵنیابیتەوە کە ئەمە ڕیپۆیەکی Gitـە، بنووسە {/cde/}git status{/cde_e/} و ئەگەر ئەمەی نەگەڕاندەوە 'fatal: Not a git repository...'، سەرکەوتووبوویت!",
  "Make a new folder (aka make directory)": "بوخچەیەکی نوێ دروست بکە (یانی folderـێک دروستبکە)",
  "Navigate into an existing folder (aka change directory)": "بڕۆ ناو بوخچەیەک کە بوونی هەیە (یانی folder بگۆڕە)",
  "List the items in a folder": "دانەکانی نێو بوخچەیەک ڕیز بکە",
  "Turn Git on for a folder": "Git دابگیرسێنە بۆ بوخچەیەک"
}
