{
  "Create a file in your new repository, add something to that file and commit that change with Git.": "پەڕگەیەک لە ڕیپۆ نوێیەکەت دروست بکە، شتێک زیاد بکە بۆ ئەو پەڕگەیە و ئەو گۆڕانکارییە commit بکە بە Git.",
  "Commits": "commitـەکان",
  "Commits are core to using Git. They are the moments in which you save and describe the work you've done. They are the ticks in the timeline of your project's history.": "commitـەکان بنەمان بۆ بەکارهێنانی Git. ئەو ساتانەن کە تێیدا ئەو کارەی تەواوت کردووە پاشەکەوت و پێناسە دەکەیت. ئەو ساتانەن کە لە سەر هێڵی کات دەردەکەوێ لە مێژووی پڕۆژەکەتدا.",
  "Create a New File": "پەڕگەیەکی نوێ دروست بکە",
  "Now that you've got a repository started let's add a file to it.": "ئێستا کە کۆگایەکت دەستپێکردووە، با پەڕگەیەکی بۆ زیاد بکەین.",
  "Open your text editor and create a new empty file. Now write a little bit of text, perhaps type {/dqm/}Hello!{/dqm/}, and save the file as 'readme.txt' in the 'hello-world' folder you created in the last challenge.": "دەستکاریکەری دەقەکەت بکەرەوە و پەڕگەیەکی بەتاڵ دروست بکە. ئێستا هەندێک دەق بنووسە، ئەتوانی بنووسی {/dqm/}سڵاو!{/dqm/}، وە پەڕگەکە پاشەکەوت بکە وەک 'readme.txt' لە بوخچەی 'hello-world' کە لە ئەرکی پێشوودا دروستت کرد.",
  "Check Status + Add and Commit Changes": "دۆخ بپشکنە + گۆڕانکارییەکان زیادبکە و پاشەکەوتیان بکە",
  "Next check the {/str/}status{/str_e/} of your repository to find out if there have been changes. You know you have changed something, but does Git?": "پاشان {/str/}دۆخی{/str_e/} کۆگاکەت بپشکنە تا بزانی هیچ گۆڕانکارییەک کراون. تۆ ئەزانی کە شتێکت گۆڕیوە، بەڵام ئایا Git دەزانێ؟",
  "Make sure you're still within your 'hello-world' directory when you're running these commands. Use Git to see what changed in your repository:": "دڵنیابەرەوە هێشتا لە بوخچەی 'hello-world' دایت کە ئەم فرمانانە جێبەجێ دەکەیت. Git بەکاربهێنە تا ببینی چی گۆڕاوە لە کۆگاکەتدا:",
  "First, check the status:": "سەرەتا، دۆخەکە بپشکنە:",
  "Git should tell you that a file has been added.": "Git پێویستە پێت بڵێ کە پەڕگەیەک گۆڕابێ.",
  "Then {/str/}add{/str_e/} the file you just created so that it becomes a part of the changes you will {/str/}commit{/str_e/} (aka save) with Git:": "دواتر پەڕگەکان کە زۆرنابێ دروستتکردوون {/str/}زیادبکە{/str_e/} تا ببێ بە بەشێک لەو گۆڕانکارییانەی کە {/str/}commit{/str_e/}(یان پاشەکەوت)ـی ئەکەیت بە Git:",
  "Finally, {/str/}commit{/str_e/} those changes to the repository's history with a short (m) message describing the updates.": "لە کۆتاییدا، ئەو گۆڕانکارییانە {/str/}commit{/str_e/} بکە بۆ مێژووی کۆگاکەت لەگەڵ نامەیەکی (m) کورت کە پێناسەی نوێکارییەکە دەکات.",
  "Step: Make More Changes": "هەنگاو: گۆڕانکاری زیاتر بکە",
  "Now add another line to 'readme.txt' and save the file again.": "ئێستا دێڕێکی دیکە زیادبکە بۆ 'readme.txt' و دووبارە پەڕگەکە پاشەکەوت بکە.",
  "In terminal, you can view the {/str/}diff{/str_e/}erence between the file now and how it was at your last commit.": "لە تێرمیناڵ، ئەتوانیت {/str/}diff{/str_e/}جیاوازی پەڕگەکە ببینیت کە ئێستا چۆنە و لە commitـی پێشوودا چۆن بووە.",
  "Tell Git to show you the {/str/}diff{/str_e/}:": "بە Git بڵێ کە {/str/}diff{/str_e/}ـەکەت پشان بدات:",
  "Now with what you just learned above, commit this latest change.": "ئێستا لەگەڵ ئەوەی لەسەرەوە فێربوویت، کۆتا گۆڕانکارییەکان commit بکە.",
  "Check status of changes to a repository": "دۆخی گۆڕانکارییەکان بپشکنە لە ڕیپۆیەکدا",
  "View changes to files": "گۆڕانکاری پەڕگەکان ببینە",
  "Add a file's changes to be committed": "گۆڕانکاری پەڕگەکان زیادبکە تا commit بکرێن",
  "To add all files changes": "بۆ زیادکردنی هەموو گۆڕانکارییەکانی پەڕگەکان",
  "To commit (aka save) the changes you've added with a short message describing the changes": "بۆ commit (یانی پاشەکەوت کردن)ـی گۆڕانکارییەکان کە زیادت کردوون لەگەڵ نامەیەکی کورت لە پێناسەی گۆڕانکارییەکان ئەکا"
}
