{
  "Create a GitHub account and add your username to your Git config.": "هەژمارێکی GitHub دروست بکە و نازناوەکەت زیادبکە بۆ ڕێکخستنی Gitـەکەت.",
  "Working Better, Together": "کارکردنی باشتر، بەیەکەوە",
  "The repository you've created so far is just on your computer, which is handy, but makes it pretty hard to share and work on with others. No worries, that's what GitHub is for!": "ئەو کۆگایەی دروستت کردووە تا ئێستا تەنها لەسەر کۆمپیوتەرەکەتە، کە خۆی لە خۆیدا بەسوودە، بەڵام هاوبەشی پێکردنی و کارکردن لەسەری لەگەڵ ئەوانی تردا گران دەکات. نیگەران مەبە، GitHub بۆ ئەوەیە!",
  "GitHub is a website that allows people everywhere to upload what they're working on with Git so that everyone can easily work together on the same project. GitHub which acts as the central repository for you and everyone else to share. You push your changes to it and pull down changes from others.": "GitHub ماڵپەڕێکە کە ڕێگە بە خەڵک دەدات لە هەموو شوێنێکەوە ئەو شتەی کە کاری لەسەر دەکەن بە Git بەرزبکەنەوە تا هەموو کەس بە ئاسانی بتوانن بەیەکەوە کاربکەن لەسەر هەمان پڕۆژە. تۆ گۆڕانکارییەکانتی بۆ ئەنێری و گۆڕانکاریی لەوانی ترەوە ڕادەکێشی.",
  "Create a GitHub Account": "هەژمارێکی GitHub دروست بکە",
  "Visit {/lnk_github/}github.com{/lnk_e/} and sign up for a free account. {/str/}High five, welcome!{/str_e/}": "سەردانی {/lnk_github/}github.com{/lnk_e/} بکە و هەژمارێکی خۆڕایی دروست بکە. {/str/}لێدەوە، یاخوا بەخێربێی!{/str_e/}",
  "Add GitHub username to Git": "نازاناوی GitHub زیادبکە بۆ Git",
  "Add your GitHub username to your Git configuration. We'll do this just for the sake of Git-it{/smc/} it makes it easier to verify the upcoming challenges. Save it exactly as you created it on GitHub and {/str/}capitalize where capitalized{/str_e/}. Note, you don't need to enter the {/dqm/}{/lt/}{/dqm/} and {/dqm/}{/gt/}{/dqm/}.": "نازناوی GitHub زیادبکە بۆ ڕێکخستنی Git. ئێمە ئەمە تەنها لەبەر Git-it ئەکەین{/smc/}ئەمە وادەکات بەئاسانی دڵنیاببینەوە لە گۆڕانکارییەکانی داهاتوو. پاشەکەوتی بکە ڕێک بەوجۆرەی دروستت کرد لەسەر GitHub و {/str/}پیتەکان گەورە بکە لە کوێ گەورە کرابوو{/str_e/}. تێبینی بکە، پێویست ناکات ئەمانە {/dqm/}{/lt/}{/dqm/} و {/dqm/}{/gt/}{/dqm/} بنووسیت. ",
  "Add your GitHub username to your Git configuration:": "نازناوی GitHubـەکەت زیادبکە بۆ ڕێکخستنی Git:",
  "You can double check what you have set in your Git config by typing:": "ئەتوانی دووبارە دڵنیاببیتەوە چیت داناوە لە ڕێکخستنەکەی Gitـت:",
  "Make sure you type {/cde/}user.username{/cde_e/} above and not {/cde/}user.name{/cde_e/}, which would override the name you set in the first challenge and leave you with no username property! If you found you did that, it's ok, just repeat the step in the first challenge to add your name and then complete the step above.": "دڵنیابەرەوە کە بنووسیت {/cde/}user.username{/cde_e/} لەسەرە و نەک {/cde/}user.name{/cde_e/}، کە ئەمە ناوەکەت ئەگۆڕێ کە لەیەک ئەرکدا داتنابوو وە نازناوەکەت بە بەتاڵی بەجێ دەمێنێ! ئەگەر ئەوەت کردووە، قەیناکە، تەنها هەنگاوی یەکەم ئەرک دووبارە بکەرەوە بۆ زیادکردنی ناوەکەت و ئینجا هەنگاوی سەرەوە جێبەجێ بکەوە.",
  "GitHub & Git config usernames do not match": "نازناوەکانی GitHub و نازناوی ڕێکخستنەکانی Git هەمان شت نین",
  "A common error is not having your GitHub username match the case of the one you set with {/cde/}git config{/cde_e/}. For instance, 'JLord' isn't the same as 'jlord'": "هەڵەیەکی باوە کە نازناوی GitHubـەکەت هەمان گەورەو بچووکی نەبێ کە داتناوە بە {/cde/}git config{/cde_e/}. بۆ نموونە، 'JLord' هەمان شت نییە لەگەڵ 'jlord'",
  "To change your username set with Git, just do the same command you did earlier, but with the correct capitalization:": "بۆ گۆڕینی نازناوەکەت بە Git، تەنها هەمان فرمان ئەنجام بدەوە کە پێشتر کردت، بەڵام با گەورەو بچووکی پیتەکان ڕاست بن:",
  "When you've made your updates, verify again!": "کە نوێکارییەکانت تەواو کرد، دووبارە بسەلمێنە!"
}
