{
  "Fork a project from GitHub.com and clone it locally.": "پڕۆژەیەک Fork بکە و ناوخۆیی لەبەرگی بگرەوە.",
  "Forks": "Forkـەکان",
  "So far you have made a project locally and pushed it to GitHub, but that's only half the fun! The other half is working with other people and other projects.": "هەتا ئێستا پڕۆژەیەکی ناوخۆییت دروست کردووە و ناردووتە بۆ GitHub، بەڵام ئەمە تەنها نیوەی خۆشیەکەیە! نیوەکەی کە کارکردنە لەگەڵ خەڵکی دیکە و پڕۆژەی دیکە.",
  "When you {/str/}fork{/str_e/} a repository, you're creating a copy of it on your GitHub account. Your forked copy begins its life as a {/str/}remote{/str_e/} repository — it exists just on your GitHub account, not on your computer. Forks are used for creating your own version of a project (this diversion from the original is like taking a fork in the road) or contributing back your changes (such as bug fixes or new features) to the original project.": "کە تۆ کۆگایەک {/str/}fork{/str_e/} دەکەیت، تۆ کۆپییەکی لێ دروست دەکەیت لەسەر هەژماری GitHubـەکەی خۆت. کۆییە fork کراوەکەت ژیانی دەست پێدەکات وەک کۆگایەکی {/str/}remote{/str_e/}—تەنها لەسەر هەژماری GitHubـەکەت هەیە، لەسەر کۆمپیوتەرەکەت نییە. Forkـەکان بەکاردێن بۆ دروست کردنی وەشانی خۆت لەو پڕۆژەیە (ئەم لادانە لە ڕەسەنەکەوە وەک لادانە لە ڕێگایەک) یان بەژداری بکەیتەوە بە گۆڕانکارییەکانت (وەک چارەسەرکردنی کەلێنێک یان تایبەتمەندییەکی نوێ) بۆ پڕۆژە ڕەسەنەکە.",
  "To get a forked repository from your GitHub account onto your computer you {/str/}clone{/str_e/} it. This cloning action copies the remote repository onto your computer so that you can work on it locally.": "بۆ بەدەستخستنی کۆگایەکی forkکراو لە هەژماری GitHubـەکەتەوە بۆ سەر کۆمپیوتەرەکەت {/str/}clone{/str_e/} بکە. ئەم کرداری لەبەرگ گرتنەوە 'clone'ـەوەیە کۆگا remoteـەکە کۆپی دەکاتە ناو کۆمپیوتەرەکەتەوە تا بتوانی بە ناوخۆیی کاری لەسەر بکەیت.",
  "Fork the Patchwork Repository": "کۆگای Patchwork جیابکەوە 'fork' بکە",
  "The project we'll work with is at {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. Go to that page and click the 'Fork' button at the top right. Once the forking animation is complete, you have a copy on your account. Copy your fork's HTTP URL from the address bar in your browser, this is the address of your fork on GitHub's servers.": "ئەو پڕۆژەیەی کە کاری لەسەر دەکەین{/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}ـەیە. بڕۆ ئەو پەڕەیە و کرتە بکە لەسەر دوگمەی 'Fork' لە سەرەوە دەستە ڕاست. کە ئەنیمەیشنی لادانەکە تەواو بوو، کۆپییەکت لێی هەیە لەسەر هەژمارەکەت. HTTP URLـی forkـەکەت کۆپی بکە لە شریتی ناونیشانەکە لە وێبگەڕەکەت، ئەمە ناونیشانی  forkـەکەتە لەسەر ڕاژەکانی GitHub.",
  "Clone Your Fork Locally": "Forkـەکەت لەبەرگ بگرەوە 'Clone' بکە",
  "Now, in terminal, you'll clone the repository onto your computer. It will automatically create a new folder for the repository so there is no need to create one yourself. But make sure you aren't cloning it inside of another Git repository folder!": "ئێستا، لە تێرمیناڵ، کۆگاکە clone ئەکەیتە سەر کۆمپیوتەرەکەت. خۆکارانە بوخچەیەکی نوێ ئەکاتەوە بۆ کۆگاکە بۆیە پێویست ناکات خۆت دانەیەک دروست بکەیت. بەڵام وریابە clone نەکەیت لە ناو بوخچەی کۆگایەکی دیکەی Git.",
  "So be sure you're not inside of the 'hello-world' directory from the previous challenges. To back out and leave this folder so that you can clone, follow these steps:": "بۆیە دڵنیابە لە ناو بوخچەی 'hello-world' نیت کە لە ئەرکەکانی پێشوودا دروستت کرد. بۆ گەڕانەوە و دەرچوون لەو بوخچەیە تا بتوانی clone بکەیت، ئەم هەنگاوانە بگرە بەر:",
  "Back out of your 'hello-world' folder:": "بگەڕێوە دەرەوە لە بوخچەی 'hello-world'ـەکەت:",
  "Tip: the two dots mean step out of a directory one level": "زانیاری: دوو خاڵەکە بە واتای یەک ئاست دەرچوون دێ لە بوخچەکە ",
  "Now that you're no longer in another Git repository, clone your fork:": "ئێستا کە چیدیکە لە ناو کۆگایەکی دیکەی Gitـدا نیت، forkـەکەت clone بکە:",
  "Go into the folder it created for your local copy of the fork (in this case, named 'patchwork').": "بڕۆ ناو ئەو بوخچەیەی دروستی کردووە بۆ کۆپییە ناوخۆییەکەی forkـەکە (لەم حاڵەتەدا، ناونراوە 'patchwork').",
  "Now you've got a copy of the repository on your computer and it is automatically connected to the remote repository (your forked copy) on your GitHub account. Type {/cde/}git remote -v{/cde_e/} to see that the address to the fork is already set up.": "ئێستا کە کۆپییەکی کۆگاکەت وەرگرتووە لەسەر کۆمپیوتەرەکەت و بە خۆکارانە بەستراوەتەوە بە کۆگا remoteـەکەوە (کۆپییە fork کراوەکەت) لەسەر هەژماری GitHubـەکەت. بنووسە {/cde/}git remote -v{/cde_e/} تا ببینی کە ناونیشانی forkـەکە دانراوە.",
  "Connect to the Original Repository": "پەیوەست ببە بە کۆگا ڕەسەنەکەوە",
  "What if the original repository you forked happens to change? You'll want to be able to {/str/}pull{/str_e/} in those changes too. So let's add another remote connection, this time to the original, {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}, repository with its URL.": "چی ئەگەر ڕوویدا کۆگا ڕەسەنەکەی forkـت کردبوو گۆڕا؟ ئەتەوێت کە بتوانیت ئەو گۆڕانکاریانەش {/str/}pull{/str_e/} بکەیت. با پەیوەندییەکی remote دیکەش زیادبکەین، ئەمجارە بۆ ڕەسەنەکە، {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}، کۆگا لەگەڵ URLـەکەی. ",
  "You can name this remote connection anything you want, but typically people use the name 'upstream'{/smc/} let's use that for this.": "ئەتوانی ناوی ئەم پەیوەندییە remote بنێی بە دڵی خۆت، بەڵام بەشێوەیەکی ئاسایی خەڵک ناوی 'upstream' بەکاردەهێنێ{/smc/} با ئەو ناوە بەکاربهێنین بۆ ئەمە.  ",
  "To be sure you have the correct remotes set up, type {/cde/}git remote -v{/cde_e/} to list out the addresses you have stored. {/str/}You should have an 'origin' remote with your fork's address and then an 'upstream' remote with the address to the original, the URL noted above in this step.{/str_e/}": "بۆ ئەوەی دڵنیاببیت کە remoteـە ڕاستەکانت داناوە، بنووسە {/cde/}git remote -v{/cde_e/} بۆ ڕیزکردنی ناونیشانەکان کە پاشەکەوتت کردوون. {/str/}پێویستە remoteـێکی 'origin'ـت هەبێ لەگەڵ ناونیشانی forkـەکەت و پاشان 'upstream'ـێک لەگەڵ ناونیشانی ڕەسەنەکە، URLـەکە تێبینی کرا لەسەرەوە لەم هەنگاوە.{/str_e/} ",
  "Add a remote": "remoteـێک زیاد بکە",
  "Change a remote URL": "URLـی remoteـێک بگۆڕە",
  "View remote connections": "پەیوەندییە remoteـەکان ببینە"
}
