{
  "Add a collaborator to your project.": "خۆبەخشێك زیادبکە بۆ پڕۆژەکەت.",
  "Social Coding": "کۆدنووسی کۆمەڵایەتی",
  "Working with others is one of the best things about GitHub because it is easier to work from any place or timezone with someone else.": "کارکردن لەگەڵ ئەوانی دیکە یەکێکە لە باشترین شتەکان دەربارەی Github چونکە ئاسانترە بۆ کارکردن لە هەر شوێن و ناوچەیەکی کاتەوە لەگەڵ کەسێکی دیکە.",
  "{/str/}Collaborators{/str_e/} are other GitHub users who are given permission to make edits to a repository owned by someone else. You may also hear the term {/str/}contributor{/str_e/}, this describes another GitHub user who has made contributions, through a Fork and Pull Request, to a project.": "{/str/} هاوکاران{/str_e/} بەکارهێنەرەکانی تری Githubـن کە ڕێگەیان پێدەدرێ گۆڕانکاری بکەن لە ڕیپۆیەکدا کە خاوەندارێتی ئەکرێ لەلایەن کەسێکی دیکەوە. هەروەها ڕەنگە گوێبیستی {/str/}خۆبەخش{/str_e/} ببیت، ئەمە پێناسەی بەکارهێنەرێکی تری Github دەکات کە بەشداری کردووە، بەهۆی Fork و Pull Requestـێکەوە، لە پڕۆژەکەدا.",
  "{/lnk_reporobot/}@reporobot{/lnk_e/} is a robot from outer space that loves collaborating on repos.": "{/lnk_reporobot/}@reporobot{/lnk_e/} ڕۆبۆتێکە لە بۆشایی دەرەوە حەز بە هاوکاری دەکات لە ڕیپۆکان.",
  "Hello, Repo Robot!": "سڵاو، ڕۆبۆتی ڕیپۆ!",
  "To add collaborators to one of your projects, visit the repository's page on your GitHub account and click the 'Settings' tab in the menu in the upper part of the page. Then select the 'Manage access' option and click on 'Invite a collaborator'. Type the username into the text box, select the right user and finally add the collaborator to your repository by clicking the green button.": "بۆ زیادکرانی هاوکارەکان بۆ یەکێک لە پڕۆژەکانت، سەردانی پەڕەی ڕیپۆکەت بکە لەسەر هەژماری Githubـەکەت و کرتە بکە لە بەشی 'Settings' لە لیستەکەدا لە بەشی سەرەوەی پەڕەکە. پاشان هەڵبژاردەی 'Manage access' دیاریبکە و کرتە لە 'Invite collaborator' بکە. نازناوەکەی لە لاکێشەی نوسینەکە بنووسە، بەکارهێنەرە دروستەکە هەڵبژێرە و لە کۆتاییدا هاوکارەکە زیادبکە بۆ ڕیپۆکەت بە کرتە کردن لەسەر دوگمە سەوزەکە.",
  "{/str/}Now go to your forked Patchwork repository's page on GitHub and add 'RepoRobot' as a collaborator.{/str_e/} The URL should look like this, but with your own username.": "{/str/}ئێستا بڕۆ بۆ پەڕەی ڕیپۆ پارچەئیشە forkـکراوەکەت لەسەر Github و  'RepoRobot' زیادبکە وەک هاوکار.{/str_e/} URLـەکە لەمە دەچێ بەڵام نازناوەکەی خۆتی لەگەڵە."
}
