{
  "Submit a Pull Request to the original Patchwork repository.": "Pull Requestـێک بکەرەوە لە کۆگا ڕەسەنەکەی Patchwork.",
  "Pull Requests": "Pull Requestـەکان",
  "Often when you make changes and improvements to a project you've forked, you'll want to send those changes to the maintainer of the original and {/str/}request{/str_e/} that they {/str/}pull{/str_e/} those changes into the original so that everyone can benefit from the updates—that's a {/str/}pull request{/str_e/}.": "زۆربەی کات کە گۆڕانکاری و چاککردن ئەکەیت لەسەر پڕۆژەیەک کە forkـت کردووە، ئەتەوێ ئەو گۆڕانکارییانە بنێریتەوە بۆ maintainer 'بەردەوامی پێدەر'ـی پڕۆژە ڕەسەنەکە و داوا {/str/}request{/str_e/} ـیان لێبکەیت کە ئەو گۆڕانکارییانە ڕابکێشن - {/str/}pull{/str_e/} - بکەنە ناو پڕۆژە ڕەسەنەکەوە تا هەموو کەس سوود لەو نوێکارییانە وەربگرێت — ئەمەیە {/str/}pull request{/str_e/}.",
  "We want to add you to the list of workshop finishers, so make a {/str/}pull request{/str_e/} to add your username file to the original: {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}.": "دەمانەوێت زیادت بکەین بۆ لیستی ئەوانەی workshopـەکەیان تەواو کردووە، بۆیە {/str/}pull request{/str_e/} بکەرەوە بۆ زیادکردنی پەڕگەی نازناوەکەت بۆ کۆگا ڕەسەنەکە: {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. ",
  "Create a pull request": "pull requestـێک دروست بکە",
  "Visit the original repository you forked on GitHub, in this case {/lnk_patchwork/}{/urlpatchwork/}{/lnk_e/}.": "سەردانی کۆگا ڕەسەنەکە بکە کە forkـت کردبوو لەسەر GitHub، لەم حاڵەتەدا {/lnk_patchwork/}{/urlpatchwork/}{/lnk_e/}.",
  "Often GitHub will detect if you've pushed a branch to a fork and display it at the top of the original's website. If you see that with your 'add-username' branch, you can click to create a Pull Request from there. If not:": "زۆربەی کات GitHub پێدەزانێ کە لقێک ئەنێری بۆ forkـێک و لە سەری سەرەوەی ماڵپەڕی کۆگا ڕەسەنەکە پێشانی ئەدات. ئەگەر ئەوەت بینی ەگەڵ ناوی خۆت لقی 'add-username'ـەکەت، ئەتوانی کرتە لە create a Pull Request' بکەی لەوێ، ئەگەرنا:",
  "Click the green 'New pull request' button.": "کرتە لە دوگمە سەوزەکە بکە کە نوسراوە 'New pull request'",
  "Select the branch with the changes you want to submit. It should be the one with 'add-yourusername'.": "ئەو لقە دیاری بکە کە گۆڕانکارییەکانی تێدایە و دەتەوێ  بینێریتەوە. ئەبێ ئەو لقە بێ کە ناوەکەی وەک 'add-yourusername'ـە.",
  "You'll now see a page with the details of the pull request you're in the process of submitting. This page shows the commits and changes, in the form of a diff, associated with your pull request as compared to the 'gh-pages' branch of the original.": "ئێستا  پەڕەیەک ئەبینی کە ووردەکاری pull requestـەکەی تێدایە کە خەریکیت بیکەیتەوە. ئەم پەڕەیە commitـەکان و گۆڕانکارییەکان پێشان ئەدات، لە شێوەی جیاوازی کردنێکدا، بەستراوەتەوە بە pull requestـەکەتەوە بە بەراورد بە لقی 'gh-pages' لە کۆگا ڕەسەنەکە.",
  "If the original repository has a {/str/}contribution documentation{/str_e/}, GitHub will link to it. This is documentation from repository owners on how to best make contributions to that project—very helpful to read if you'd like to see your changes adopted!": "ئەگەر کۆگا ڕەسەنەکە خاوەنی {/str/}بەڵگەنامەی بەژداریکردن{/str_e/} بوو، GitHub بەستەرێی بۆ دادەنێ. ئەمە بەڵگەنامەیەکە لە خاوەنی کۆگاکەوە دەربارەی ئەوەی چۆن بە باشترین شێوە بەژداری لەو پڕۆژەیەدا بکەیت — زۆر بە کەڵکە بیخوێنیتەوە گەر حەزدەکەیت ببینیت گۆڕانکارییەکانت لە خۆدەگیرێت.",
  "If everything on the page looks good and as you expect it:": "ئەگەر هەموو شتێک لەسەر پەڕەکە باشە و بەوجۆرە دەردەکەوێ کە پێشبینی دەکەیت:",
  "Click 'Create pull request'": "کرتە بکە لەسەر 'Create pull request'!",
  "Add a title and description to the changes you're suggesting the original author pull in.": "ناونیشان و پێناسەیەک زیادبکە بۆ گۆڕانکارییەکان کە پێشنیاری دەکەیت خاوەنی کۆگا ڕەسەنەکە ڕایبکێشێتە ناوەوە.",
  "Click 'Send pull request'!": "کرتە بکە لەسەر 'Send pull request'!",
  "Bingo! You submitted a pull request—take a few seconds to bask in the moment.": "پیرۆزە! pull requestـێکت پێشکەش کرد — چێژ لەم ساتە وەربگرە.",
  "If all is well with your pull request, it will be merged within moments. If it's not merged automatically within a few minutes, you'll then likely have some comments from @reporobot on why it couldn't merge it. If this is the case, close your pull request on GitHub, make the necessary changes to your branch, push those changes back to your fork and reopen (this will poke @reporobot to look over it again) your pull request.": "ئەگەر هەموو شت ڕێک بێت لە pull requestـەکەت، ڕەنگە دوای چەند ساتێک یەکبخرێت. ئەگەر خۆکارانە دوای چەند خولەکێک یەکنەخرا، ڕەنگە سەرنجێکت بۆ نوسرابێ لەلایەن @reporobot کە بۆچی نەتوانراوە یەکبخرێت. ئەگەر بەوجۆرەیە، pull requestـەکەت دابخە لەسەر GitHub، گۆڕانکارییە پێویستەکان بکە لە لقەکەت، گۆڕانکارییەکان بنێرەوە بۆ forkـەکەت و دووبارە pull requestـەکەت بکەرەوە (ئەمە @reporobot هاندەدات دووبارە سەیری بکاتەوە)."
}
