{
  "Create a new repository on your computer.": "Tworzenie nowego repozytorium na Twoim komputerze.",
  "Repositories": "Repozytoria",
  "A {/str/}repository{/str_e/} is a collection of related items. In our case, when writing software, it is a collection of files related to a software project. You can imagine it as a project folder with all the relevant files inside of it. In fact, that's what it will look like on your computer anyways. Sometimes they're called 'repos' for short.": "{/str/}Repozytorium{/str_e/} jest zbiorem powiązanych elementów. W naszym przypadku, kiedy piszemy aplikację jest to kolekcja plików związanych z danym projektem. Wyobraź sobie to jako folder z projektem zawierający  wszystkie powiązane z nim pliki. W rzeczywistości tak właśnie będzie to wyglądało. Repozytoria często nazywa się \"repo\".",
  "You tell Git what your project is and Git will start tracking all of the changes to that folder. This makes it a Git repository: a folder of items being tracked by Git. Git tracks when files are added, subtracted or even a single letter in a single file is changed. All of this plus who did it and when is tracked by Git. In software, tracking changes like this is called {/str/}version control{/str_e/}.": "Wskazujesz Gitowi czym jest Twój projekt i zaczyna on śledzić wszystkie zmiany w wybranym folderze. To czyni go repozytorium Git: folder z elementami śledzony przez Git. Git śledzi jakie elementy są dodawane, usuwane, a nawet kosmetyczne zmiany jak korekta jednej litery w pojedynczym pliku. Wszystko to plus kto i kiedy dokonał zmiany są śledzone przez Git. W programowaniu, śledzenie takich zmian nazywane jest {/str/}kontrolą wersji{/str_e/}.",
  "Using Terminal": "Korzystanie z terminala",
  "{/str/}Terminal{/str_e/} (or Bash) is a way to instruct your computer to do things by typing commands rather than clicking applications with your mouse. You can rename files, open files, create new folders, move between directories (folders) and more all by running typed commands. You can even use a text editor for code (like {/lnk_vim/}Vim{/lnk_e/}) in your terminal an never have to leave!": "{/str/}Terminal{/str_e/} (lub Bash) jest sposobem na poinstruowanie Twojego komputera co ma zrobić poprzez wpisywanie poleceń zamiast interakcji z aplikacją poprzez interfejs graficzny. Możliwe jest zmienianie nazw plików, otwieranie ich, tworzenie nowych katalogów i poruszanie się między nimi, a także wiele więcej za pomocą samych komend. Możesz nawet korzystać z edytora tekstowego by tworzyć program (jak {/lnk_vim/}Vim{/lnk_e/}) w swoim terminalu i nigdy nie musieć go zamykać!",
  "Besides navigating your computer, you can also use programs in Terminal that have a {/str/}command-line interface (CLI){/str_e/}, meaning they can be run with commands in terminal. Git is one of these. The first part of the command lets your computer know you're talking to Git. The parts following that are the commands and the different options you want Git to act on.": "Oprócz nawigacji po swoim komputerze możesz także uruchamiać programy korzystające z {/str/}wiersza poleceń (ang. CLI - Command Line Interface){/str_e/}, co oznacza iż mogą one być uruchamiane za pomocą poleceń wydawanych w terminalu. Git jest jednym z nich. Pierwsza część polecenia mówi Twojemu komputerowi, że rozmawiasz z Gitem. Następne składowe polecenia są poleceniami i różnymi opcjami mówiącymi Gitowi jak ma się zachować.",
  "In Git-it you'll learn a few basic command-line actions (in addition to Git commands) for navigating your computer. They're described within the steps.": "W Git-it nauczysz się paru podstawowych akcji wiersza poleceń (jako dodatek do poleceń Git) do nawigowania po Twoim komputerze; są opisane w poszczególnych krokach.",
  "Create a Repository": "Tworzenie repozytorium",
  "You're going to create a new project folder and then initialize it as a Git repository. We'll name the folder 'hello-world' in this challenge, but you can choose a different name if you already have a folder named this (it's a common first project name).": "Utworzysz nowy folder projektu i zainicjujesz w nim nowe repozytorium Git. Na potrzeby tego wyzwania nazwiemy ten folder 'hello-world', ale możesz wybrać inną nazwę jeśli posiadasz już folder o tej nazwie (jest to popularna nazwa dla pierwszych projektów).",
  "Time to open your terminal!": "Czas otworzyć terminal!",
  "In your terminal window, type these commands, one at a time, pressing enter/return after each.": "W oknie Twojego terminala wprowadź następujące polecenia, jedno po drugim, zatwierdzając przyciskiem enter/return po każdej wprowadzonej linii.",
  "First, make a new folder:": "Najpierw, utwórz nowy folder:",
  "Tip: mkdir stands for {/em/}make directory{/em_e/}": "Tip: mkdir stands for make directory\nRada: mkdir jest skróceniem angielskiego wyrażenia {/em/}make directory{/em_e/} (pol. utwórz katalog)",
  "Then go into that folder:": "Następnie przejdź do tego katalogu:",
  "Tip: cd stands for {/em/}change directory{/em_e/}": "Rada: cd jest skróceniem angielskiego wyrażenia {/em/}change directory{/em_e/} (pol. zmień katalog)",
  "Finally, tell Git to initialize (start tracking) the folder you are now in:": "Na koniec, powiedz Gitowi by zainicjalizował (zaczął śledzić) folder, w którym się znajdujesz:",
  "The last command should return something starting with 'Initialized empty Git repository'. The others commands do not return anything.": "Ostatnie polecenie powinno zwrócić informację zawierającą 'Initialized empty Git repository'. Inne polecenia nie powinny zwrócić nic.",
  "You did it! If you want to be double-sure that it's a Git repository, type {/cde/}git status{/cde_e/} and if it doesn't return 'fatal: Not a git repository...', you're golden!": "Udało Ci się! Jeśli chcesz się upewnić, że inicjalizacja repozytorium Git przebiegła poprawnie, wpisz {/cde/}git status{/cde_e/} i jeśli wykonanie tego polecenia nie zwróci 'fatal: Not a git repository...', masz to jak w banku!",
  "Make a new folder (aka make directory)": "Tworzenie nowego folderu (aka tworzenie katalogu)",
  "Navigate into an existing folder (aka change directory)": "Przejście do istniejącego folderu (aka zmiana katalogu)",
  "List the items in a folder": "Wyświetlenie zawartości bieżącego katalogu",
  "Turn Git on for a folder": "Inicjalizacja repozytorium Git w bieżącym katalogu"
}
