{
  "Create a file in your new repository, add something to that file and commit that change with Git.": "Tworzenie pliku w Twoim nowym repozytorium, dodawanie mu zawartości i zatwierdzenie zmian za pomocą Git.",
  "Commits": "Zatwierdzenia zmian",
  "Commits are core to using Git. They are the moments in which you save and describe the work you've done. They are the ticks in the timeline of your project's history.": "Zatwierdzenia zmian (potocznie zwane commitami od angielskiego Commits) są kluczem do korzystania z Gita. Są to momenty w których zapisywałeś i opisywałeś wykonaną pracę. To punkty na osi czasu Twojego projektu.",
  "Create a New File": "Tworzenie nowego pliku",
  "Now that you've got a repository started let's add a file to it.": "Teraz gdy masz już skonfigurowane repozytorium dodaj do niego plik.",
  "Open your text editor and create a new empty file. Now write a little bit of text, perhaps type {/dqm/}Hello!{/dqm/}, and save the file as 'readme.txt' in the 'hello-world' folder you created in the last challenge.": "Otwórz swój edytor tekstowy i utwórz nowy pusty plik. Teraz wprowadź do niego zawartość, może podstawowe przywitanie {/dqm/}Cześć!{/dqm/}, i zapisz go jako 'readme.txt' w folderze 'hello-world' utworzonym w ostatnim wyzwaniu.",
  "Check Status + Add and Commit Changes": "Sprawdzanie statusu + dodawanie i zatwierdzanie zmian",
  "Next check the {/str/}status{/str_e/} of your repository to find out if there have been changes. You know you have changed something, but does Git?": "Następnie sprawdź {/str/}status{/str_e/} repozytorium by dowiedzieć się czy miały miejsce zmiany. Ty wiesz o tym kiedy coś zmieniasz, ale czy Git wie?",
  "Make sure you're still within your 'hello-world' directory when you're running these commands. Use Git to see what changed in your repository:": "Upewnij się, że nadal jesteś w folderze 'hello-world' kiedy będziesz uruchamiał poniższe polecenia. Za pomocą Gita sprawdź co się zmieniło w repozytorium:",
  "First, check the status:": "Najpierw sprawdź status repozytorium:",
  "Git should tell you that a file has been added.": "Git powinien powiedzieć Ci, że plik został dodany.",
  "Then {/str/}add{/str_e/} the file you just created so that it becomes a part of the changes you will {/str/}commit{/str_e/} (aka save) with Git:": "Następnie {/str/}dodaj{/str_e/} dopiero utworzony plik do listy zmian do {/str/}zatwierdzenia{/str_e/} (zapisania) za pomocą Gita:",
  "Finally, {/str/}commit{/str_e/} those changes to the repository's history with a short (m) message describing the updates.": "Na koniec, {/str/}zatwierdź{/str_e/} wybrane zmiany w historii repozytorium wraz z krótką wiadomością opisującą zawartość aktualizacji.",
  "Step: Make More Changes": "Krok: zrób więcej zmian",
  "Now add another line to 'readme.txt' and save the file again.": "Dodaj kolejną linię do 'readme.txt' i po raz kolejny zapisz plik.",
  "In terminal, you can view the {/str/}diff{/str_e/}erence between the file now and how it was at your last commit.": "W terminalu możesz zobaczyć {/str/}różnicę{/str_e/} pomiędzy plikiem teraz, a ostatnim zatwierdzonym stanem.",
  "Tell Git to show you the {/str/}diff{/str_e/}:": "Poinstruuj gita by wyświetlił {/str/}różnice{/str_e/}:",
  "Now with what you just learned above, commit this latest change.": "Wykorzystując wiedzę z poprzedniego kroku, zapisz bieżące zmiany.",
  "Check status of changes to a repository": "Sprawdzanie statusu zmian w repozytorium",
  "View changes to files": "Wyświetlanie zmian w plikach",
  "Add a file's changes to be committed": "Dodawanie zmian w pliku do zatwierdzania",
  "To add all files changes": "Dodawanie wszystkich zmian do zatwierdzania",
  "To commit (aka save) the changes you've added with a short message describing the changes": "Zatwierdzanie dodanych zmian wraz z ich krótkim opisem"
}
