{
  "Create a GitHub account and add your username to your Git config.": "Tworzenie konta GitHub i dodawanie nazwy użytkownika do konfiguracji Gita.",
  "Working Better, Together": "Lepsza (współ)praca",
  "The repository you've created so far is just on your computer, which is handy, but makes it pretty hard to share and work on with others. No worries, that's what GitHub is for!": "Repozytorium które utworzyłeś znajduje się w tej chwili tylko na Twoim komputerze, co jest poręczne, ale czyni to je niezbyt wygodnym jeśli chodzi o współpracę z innymi. Nie martw się, właśnie po to istnieje GitHub!",
  "GitHub is a website that allows people everywhere to upload what they're working on with Git so that everyone can easily work together on the same project. GitHub which acts as the central repository for you and everyone else to share. You push your changes to it and pull down changes from others.": "GitHub jest stroną pozwalającą ludziom z całego świata na udostępnianie tego nad czym obecnie pracują używając Gita, by każdy mógł wygodnie współpracować nad tym samym projektem. GitHub działa jak centralne repozytorium dla Ciebie i innych. 'Wypychasz' (od angielskiego push) swoje zmiany i pobierasz zmiany od innych osób.",
  "Create a GitHub Account": "Tworzenie konta GitHub",
  "Visit {/lnk_github/}github.com{/lnk_e/} and sign up for a free account. {/str/}High five, welcome!{/str_e/}": "Odwiedź stronę {/lnk_github/}github.com{/lnk_e/} i utwórz darmowe konto. {/str/}Witamy, przybij piątkę!{/str_e/}",
  "Add GitHub username to Git": "Dodawanie nazwy użytkownika GitHub do Gita",
  "Add your GitHub username to your Git configuration. We'll do this just for the sake of Git-it{/smc/} it makes it easier to verify the upcoming challenges. Save it exactly as you created it on GitHub and {/str/}capitalize where capitalized{/str_e/}. Note, you don't need to enter the {/dqm/}{/lt/}{/dqm/} and {/dqm/}{/gt/}{/dqm/}.": "Dodaj swoją nazwę użytkownika GitHub do konfiguracji Gita. Zrobimy to na potrzeby Git-it{/smc/} ułatwi to weryfikację przyszłych wyzwań. Zapisz ją dokładnie w taki sposób w jaki widnieje ona w GitHub i {/str/}pamiętaj, iż wielkość znaków ma znaczenie{/str_e/}. Zauważ, że nie musisz wpisywać znaków {/dqm/}{/lt/}{/dqm/} i {/dqm/}{/gt/}{/dqm/}.",
  "Add your GitHub username to your Git configuration:": "Dodaj nazwę użytkownika GitHub do swojej konfiguracji Gita:",
  "You can double check what you have set in your Git config by typing:": "Zawsze możesz upewnić się co do poprawności ustawień wpisując:",
  "Make sure you type {/cde/}user.username{/cde_e/} above and not {/cde/}user.name{/cde_e/}, which would override the name you set in the first challenge and leave you with no username property! If you found you did that, it's ok, just repeat the step in the first challenge to add your name and then complete the step above.": "Upewnij się, że powyżej wpisujesz {/cde/}user.username{/cde_e/} a nie {/cde/}user.name{/cde_e/}, które nadpisałoby ustawioną w pierwszym wyzwaniu nazwę i pozostawiło Cię bez skonfigurowanej właściwości username! Jeśli tak się stało, w porządku, po prostu powtórz krok z pierwszego wyzwania w celu dodania swojej nazwy, a następnie wykonaj krok powyżej.",
  "GitHub & Git config usernames do not match": "Nazwy GitHub i ta w konfiguracji Git nie pasują",
  "A common error is not having your GitHub username match the case of the one you set with {/cde/}git config{/cde_e/}. For instance, 'JLord' isn't the same as 'jlord'": "Popularnym błędem jest wystąpienie różnic pomiędzy nazwą GitHub, a wprowadzoną w {/cde/}git config{/cde_e/}. Na przykład, 'JLord' to nie to samo co 'jlord'",
  "To change your username set with Git, just do the same command you did earlier, but with the correct capitalization:": "By zmienić ustawioną w git nazwę użytkownika, zrób to samo co poprzednio, tym razem z poprawną wielkością liter:",
  "When you've made your updates, verify again!": "Kiedy to już zrobisz, zweryfikuj poprawność ponownie!"
}
