{
  "Connect your local repository to a remote one and push changes to it.": "Łączenie lokalnego repozytorium ze zdalnym i wypychanie zmian.",
  "Remotes": "Repozytoria zdalne",
  "When you put something on GitHub that copy lives on one of GitHub's servers. This makes it as {/str/}remote{/str_e/} repository because it is not on your computer, but on a server, {/dqm/}remote{/dqm/} and somewhere else. By {/str/}pushing{/str_e/} your {/str/}local{/str_e/} (on your computer) changes to it, you keep it up to date.": "Kiedy umieszczasz coś na GitHub ta kopia żyje na jednym z serwerów do niego należących. To czyni je {/str/}repozytorium zdalnym{/str_e/} gdyż nie znajduje się ono na Twoim komputerze, ale na serwerze, {/dqm/}zdalnie{/dqm/} i gdzieś indziej. {/str/}Wypychając{/str_e/} swoje {/str/}lokalne{/str_e/} (znajdujące się na Twoim komputerze) zmiany, czynisz je aktualnym.",
  "Others can always then get the latest from your project by {/str/}pulling{/str_e/} your changes down from the remote (and onto their computer). This is how everyone can work on a project together without needing access to your computer where your local copy is stored.": "Inni mogą zawsze {/str/}pobrać{/str_e/} najaktualniejsze zmiany z twojego projektu wprost z repozytorium zdalnego (i prosto na swój komputer). To właśnie tak wszyscy razem pracują nad jednym projektem bez konieczności uzyskiwania dostępu do Twojego komputera, gdzie przechowywana jest kopia lokalna.",
  "Create a Remote Repository": "Tworzenie repozytorium zdalnego",
  "You want to sync your {/str/}local{/str_e/} version with one stored on GitHub.com. First create a new {/str/}remote{/str_e/} repository on GitHub.com.": "Chcesz zsynchronizować zmiany zawarte w {/str/}lokalnej{/str_e/} wersji repozytorium z tymi przechowywanymi na GitHub.com. Najpierw utwórz nowe repozytorium {/str/}zdalne{/str_e/} na GitHub.com.",
  "Go to {/lnk_github/}github.com{/lnk_e/}, log in, and click the '+' in the top right and then click 'New repository'.": "Przejdź do {/lnk_github/}github.com{/lnk_e/}, zaloguj się i kliknij ikonę '+' w prawym górnym rogu, a następnie wybierz opcję 'New repository'.",
  "Give it a name that matches your local repository's name, 'hello-world', and a short description.": "Nadaj jemu nazwę odpowiadającą nazwie Twojego lokalnego repozytorium, 'hello-world', oraz krótki opis.",
  "Make it public. This means it'll be listed on your public profile.": "Wybierz repozytorium publiczne. Oznacza to, że zostanie ono zamieszczone w Twoim profilu publicznym.",
  "Don't initialize with a README because we already have a file, locally, named 'readme.txt'. This is a helper option from GitHub if you hadn't already made it.": "Nie inicjuj repozytorium plikiem README ponieważ już taki mamy lokalnie - 'readme.txt'. To jest opcja pomocnicza GitHuba, jeśli jeszcze nie masz takiego pliku.",
  "Leave '.gitignore' and 'license' set to 'none'. We won't use them this tutorial.": "Pozostaw '.gitignore' i 'license' ustawione na 'none'. Nie będziemy korzystać z nich w ramach tego poradnika.",
  "Click create repository!": "Kliknij przycisk by zatwierdzić utworzenie repozytorium!",
  "Readmes, .gitignores and Licenses": "Kliknij przycisk by zatwierdzić utworzenie repozytorium!",
  "These are common files in open source projects so to make starting a new project easier, GitHub provides an option for creating them for you.": "Są to pliki popularne w projektach open source, więc by ułatwić utworzenie nowych projektów, GitHub oferuje utworzenie ich w Twoim imieniu.",
  "A {/str/}readme{/str_e/} explains what the project is, how to use it, and often times, how to contribute (though sometimes there is an extra file, 'CONTRIBUTING.md', for those details).": "{/str/}Readme{/str_e/} ('czytaj to') wyjaśnia czym jest projekt, jak z niego korzystać, a czasami także jak włączyć się do pracy na rzecz jego rozwoju (choć czasem jest to wyjaśniane w dodatkowym pliku 'CONTRIBUTING.md', tworzonym specjalnie na taką okazję).",
  "A {/str/}.gitignore{/str_e/} is a list of files that Git should {/em/}not{/em_e/} track, for instance, files with passwords!": "{/str/}.gitignore{/str_e/} zawiera listę plików których Git {/em/}nie{/em_e/} powinien śledzić, takie jakie pliki zawierające hasła czy dostępy do systemów produkcyjnych!",
  "A {/str/}license{/str_e/} file is the type of license you put on your project. This lets others know how they can use it. Information on the types is here: {/lnk_license/}choosealicense.com{/lnk_e/}.": "{/str/}Plik license{/str_e/} zawiera rodzaj licencji jaka udzielana jest na projekt. Pozwala to innym na zapoznanie się z zasadami jego użytkowania. Informacje odnośnie rodzajów licencji można znaleźć tutaj: {/lnk_license/}choosealicense.com{/lnk_e/}",
  "Connect your Local to your Remote": "Podłączanie repozytorium lokalnego do repozytorium zdalnego",
  "Now you've got an empty repository started on GitHub.com. At the top you'll see 'Quick Setup', make sure the 'HTTPS' button is selected and copy the address—this is the address of your repository on GitHub's servers.": "Teraz posiadasz już utworzone puste repozytorium zdalne na on GitHub.com. Na górze znajdziesz 'Quick Setup', upewnij się, że wybrano opcję 'HTTPS' i skopiuj adres - to jest adres Twojego repozytorium na serwerach GitHuba.",
  "Back in your terminal, and inside of the 'hello-world' folder that you initialized as a Git repository in the earlier challenge, you want to tell Git to remember the address of the remote version on GitHub's servers. You can have multiple remotes so each requires a name. The primary remote is typically named {/cde/}origin{/cde_e/}.": "W swoim terminalu, w folderze 'hello-world' gdzie zainicjowałeś repozytorium w poprzednim wyzwaniu, chcesz  powiedzieć Gitowi by zapamiętał adres zdalnej wersji tego repozytorium na serwerach GitHuba. Ponieważ możesz mieć wiele repozytoriów zdalnych, każde z nich wymaga osobnej nazwy. Główne repozytorium zdalne jest często nazywane {/cde/}origin{/cde_e/}.",
  "To add a remote named 'origin' to your repository:": "W celu dodania repozytorium zdalnego 'origin' do wersji lokalnej:",
  "Your {/str/}local{/str_e/} repository now knows where your {/str/}remote{/str_e/} repository, named 'origin', lives on GitHub's servers. Think of it as adding a name and address on speed dial—now when you need to send something there, you can.": "Twoje repozytorium {/str/}lokalne{/str_e/} wie już gdzie szukać repozytorium {/str/}zdalnego{/str_e/}, nazwanego 'origin'. Pomyśl o tym jak o dodawaniu nazwy i numeru telefonu do szybkiego wybierania, jeśli chcesz szybko do kogoś zadzwonić, wystarczy po prostu wybrać odpowiednią opcję.",
  "Windows Users:": "Użytkownicy Windowsa:",
  "If you have {/str/}GitHub Desktop{/str_e/} on your computer, a remote named 'origin' is automatically created in your local repository. In that case, you'll just need to tell it what URL to associate with 'origin'. Use this command instead of the 'add' one above:": "Jeśli posiadasz na swoim komputerze aplikację {/str/}GitHub Desktop{/str_e/}, zdalne repozytorium nazwane 'origin' jest automatycznie dodawane do lokalnego repozytorium. W tej sytuacji jedyne co musisz zrobić to poinformować jaki adres URL z nim powiązać. Użyj tego polecenia zamiast 'add' powyżej:",
  "Push Work to your Remote": "Wypychanie zmian do repozytorium zdalnego",
  "Next you want to {/str/}push{/str_e/} (send) everything you've done locally to your remote repository on GitHub. This is something you'll do often so that your remote version is up to date and matching the state of your local version.": "Następnie chcesz {/str/}wypchnąć{/str_e/} (wysłać) wszystkie zmiany lokalne do repozytorium zdalnego na GitHub. To jest coś, co będziesz robić często by zapewnić, że wersja zdalna jest zawsze zaktualizowana o lokalne zmiany.",
  "Git has a branching system so that you can work on different parts of a project at different times. We'll learn more about that later, but by default the first branch is named 'master'. When you push (and later pull) from a project, you tell Git the {/str/}branch name{/str_e/} you want and the name of the {/str/}remote{/str_e/} that it lives on.": "Git posiada system gałęzi, co umożliwia skoncentrowanie prac nad różnymi aspektami projektu w różnych chwilach. Więcej dowiemy się o tym później, ale domyślnie pierwsza gałąź nazywana jest 'master'. Kiedy wypychasz (i później pobierasz) zmiany, musisz powiedzieć gitowi z której gałęzi ma skorzystać używając jej {/str/}nazwy{/str_e/} oraz nazwy repozytorium {/str/}zdalnego{/str_e/} na którym ona istnieje.",
  "In this case, we'll send our branch named 'master' to our remote on GitHub named 'origin'.": "W tym przypadku, wyślemy naszą gałąź nazwaną 'master' na nasze repozytorium GitHub nazwane 'origin'.",
  "Now go to your remote repository's page on GitHub.com and refresh the page. {/str/}Wow!{/str_e/} Everything is now the same locally as it is remotely. Congrats on your first public repository!": "Teraz przejdź na stronę swojego repozytorium zdalnego na GitHub.com i odśwież stronę. {/str/}Wow!{/str_e/}Wszystko jest teraz zsynchronizowane. Gratulacje utworzenia pierwszego repozytorium zdalnego!",
  "Add remote connections": "Dodawanie repozytorium zdalnego",
  "Set a URL to a remote": "Zmiana adresu URL do repozytorium zdalnego",
  "Pull in changes": "Pobieranie zmian",
  "View remote addresses": "Wyświetlanie listy repozytoriów zdalnych",
  "Push changes": "Wypychanie zmian"
}
