{
  "Fork a project from GitHub.com and clone it locally.": "Forkowanie projektów z GitHub.com i klonowanie ich lokalnie.",
  "Forks": "Fork",
  "So far you have made a project locally and pushed it to GitHub, but that's only half the fun! The other half is working with other people and other projects.": "Jak dotąd utworzyłeś projekt lokalnie i wypchnąłeś do repozytorium na GitHub.com, ale to tylko połowa zabawy! Druga połowa to współpraca z innymi ludźmi nad innymi projektami.",
  "When you {/str/}fork{/str_e/} a repository, you're creating a copy of it on your GitHub account. Your forked copy begins its life as a {/str/}remote{/str_e/} repository — it exists just on your GitHub account, not on your computer. Forks are used for creating your own version of a project (this diversion from the original is like taking a fork in the road) or contributing back your changes (such as bug fixes or new features) to the original project.": "Kiedy {/str/}forkujesz{/str_e/} repozytorium, tworzysz jego kopię na swoim koncie GitHub. Twoja sforkowana kopia zaczyna życie jako repozytorium {/str/}zdalne{/str_e/} - istnieje po prostu na Twoim koncie GitHub, nie na Twoim komputerze. Forki są używane do tworzenia własnych wersji projektu (ta dywersja od oryginału jest jak wybranie drugiej drogi na skrzyżowaniu) lub współpracy nad nim (jak łatanie błędów czy nowe funkcjonalności).",
  "To get a forked repository from your GitHub account onto your computer you {/str/}clone{/str_e/} it. This cloning action copies the remote repository onto your computer so that you can work on it locally.": "By pobrać sforkowane repozytorium ze swojego konta GitHub na swój komputer należy je {/str/}sklonować{/str_e/}. Klonowanie powoduje skopiowanie repozytorium zdalnego na Twój komputer w celu umożliwienia pracowania lokalnie.",
  "Fork the Patchwork Repository": "Forkowanie repozytorium Patchwork",
  "The project we'll work with is at {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. Go to that page and click the 'Fork' button at the top right. Once the forking animation is complete, you have a copy on your account. Copy your fork's HTTP URL from the address bar in your browser, this is the address of your fork on GitHub's servers.": "Projekt nad którym pochylimy się tym razem znajduje się pod adresem {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. Przejdź na tę stronę i kliknij przycisk 'Fork' w górnej prawej części widoku. Kiedy animacja forkowania się zakończy, będziesz posiadać kopię repozytorium na swoim koncie. Skopiuj adres HTTP z paska adresu swojej przeglądarki, to jest adres Twojego forka na serwerach GitHuba.",
  "Clone Your Fork Locally": "Klonowanie forka lokalnie",
  "Now, in terminal, you'll clone the repository onto your computer. It will automatically create a new folder for the repository so there is no need to create one yourself. But make sure you aren't cloning it inside of another Git repository folder!": "Teraz za pomoca terminala sklonujesz repozytorium na swój komputer. Nowy folder zostanie automatycznie utworzony by przechować repozytorium, więc nie ma potrzeby tworzyć go samodzielnie. Upewnij się jednak że nie klonujesz go do folderu w innym repozytorium!",
  "So be sure you're not inside of the 'hello-world' directory from the previous challenges. To back out and leave this folder so that you can clone, follow these steps:": "Upewnij się zatem, że nie jesteś w folderze 'hello-world' z poprzednich wyzwań. By wycofać się z niego w celu sklonowania forka, podążaj za poniższymi krokami:",
  "Back out of your 'hello-world' folder:": "Wycofaj się z folderu 'hello-world':",
  "Tip: the two dots mean step out of a directory one level": "Rada: dwie kropki oznaczają przejście do katalogu o 1 poziom wyżej",
  "Now that you're no longer in another Git repository, clone your fork:": "Po wyjściu z folderu zawierającego repozytorium Gita sklonuj swojego forka:",
  "Go into the folder it created for your local copy of the fork (in this case, named 'patchwork').": "Przejdź do folderu utworzonego dla Twojej lokalnej kopii forka (w tym przypadku nazwanej 'patchwork').",
  "Now you've got a copy of the repository on your computer and it is automatically connected to the remote repository (your forked copy) on your GitHub account. Type {/cde/}git remote -v{/cde_e/} to see that the address to the fork is already set up.": "Teraz posiadasz kopię repozytorium na swoim komputerze i jest ona połączona z repozytorium zdalnym (Twojej sforkowanej kopii) na Twoim koncie GitHub. Wpisz {/cde/}git remote -v{/cde_e/} by zobaczyć, że adres forka został już skonfigurowany.",
  "Connect to the Original Repository": "Łączenie z oryginalnym repozytorium",
  "What if the original repository you forked happens to change? You'll want to be able to {/str/}pull{/str_e/} in those changes too. So let's add another remote connection, this time to the original, {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}, repository with its URL.": "Co jeśli oryginał sforkowanego repozytorium się zmieni? Chcesz przecież mieć możliwość {/str/}pobierania{/str_e/} zmian, które pojawiły się w oryginale. Dodaj zatem kolejne odwołanie do repozytorium zdalnego, tym razem do oryginału {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}.",
  "You can name this remote connection anything you want, but typically people use the name 'upstream'{/smc/} let's use that for this.": "Możesz nazwać odwołanie do tego repozytorium jak tylko zechcesz, aczkolwiek typową nazwą funkcjonującą w społeczności jest 'upstream'{/smc/} skorzystajmy zatem z tej konwencji.",
  "To be sure you have the correct remotes set up, type {/cde/}git remote -v{/cde_e/} to list out the addresses you have stored. {/str/}You should have an 'origin' remote with your fork's address and then an 'upstream' remote with the address to the original, the URL noted above in this step.{/str_e/}": "Aby mieć pewność że połączenia ze zdalnymi repozytoriami skonfigurowano poprawnie wpisz {/cde/}git remote -v{/cde_e/} w celu wypisania listy przechowywanych adresów. {/str/}Powinieneś mieć odwołanie nazwane 'origin' referujące do Twojego forka oraz 'upstream' referujące do oryginalnej wersji repozytorium.{/str_e/}",
  "Add a remote": "Dodawanie repozytorium zdalnego",
  "Change a remote URL": "Zmiana adresu repozytorium zdalnego",
  "View remote connections": "Wyświetlanie listy repozytoriów zdalnych"
}
