{
  "Add a branch, locally, to your forked repository to work on your changes.": "Dodawanie gałęzi lokalnie do sforkowanego repozytorium by pracować nad własnymi zmianami.",
  "Branches": "Gałęzie",
  "Git repositories use branches to isolate work when needed. It's common practice when working on a project or with others on a project to create a {/str/}branch{/str_e/} to keep your working changes in. This way you can do your work while the main, commonly named 'master', branch stays stable. When the work on your branch is finished you merge it back into the 'master' master branch.": "Repozytoria Git korzystają z gałęzi do odizolowania pracy, gdy jest to wymagane. Tworzenie {/str/}gałęzi{/str_e/} jest powszechną praktyką gdy współpracujesz z innymi osobami nad projektem. W ten sposób możesz kontynuować pracę podczas gdy gałąź główna (często nazywana 'master') posiada stabilną wersję. Kiedy ukończysz pracę, scalasz ją do głównej gałęzi.",
  "The diagram below shows how you can branch off of your 'master' branch, do work and then merge those changes back into 'master'. You can even branch off of a branch if you need to, the 'master' branch doesn't have to be the base.": "Diagram poniżej pokazuje 'rozgałęzianie' od głównej gałęzi 'master', wykonanie pracy, a następnie scalenie zmian z powrotem do 'master'. Nie ma wymagania, że źródłem dla nowej gałęzi musi być 'master' - może to być dowolna inna gałąź.",
  "For a great visualization on how branches work in a project, see this GitHub Guide: {/lnk_guide/}guides.github.com/overviews/flow{/lnk_e/}": "Dla lepszej wizualizacji sposobu działania gałęzi w projektach zapoznaj się z tym poradnikiem GitHuba: {/lnk_guide/}guides.github.com/overviews/flow{/lnk_e/}",
  "GitHub Pages": "GitHub Pages",
  "GitHub will automatically serve and host static website files in branches named 'gh-pages'. This free service is called {/lnk_pages/}GitHub Pages{/lnk_e/}. Since the project you forked creates a website, its main branch is named 'gh-pages' instead of 'master'. All repositories that have a 'gh-pages' branch with website files can be found, live online, using this pattern for the URL:": "GitHub automatycznie prezentuje i hostuje strony internetowe w gałęziach nazwanych 'gh-pages'. Ta darmowa usługa nosi nazwę {/lnk_pages/}GitHub Pages{/lnk_e/}. Ponieważ projekt którego forka utworzyłeś tworzy stronę, jego główna gałąź nazwana została 'gh-pages' zamiast 'master'. Wszystkie repozytoria zawierające gałąź 'gh-pages' ze stroną mogą zostać odnalezione w sieci przy użyciu poniższego wzorca adresu URL:",
  "Create a branch": "Tworzenie gałęzi",
  "When you create a branch, Git copies everything from the current branch you're on and places it in the branch you've requested be made.": "Kiedy tworzysz gałąź git kopiuje całą zawartość bieżącej gałęzi (tej, na której jesteś) i umieszcza ją na nowej gałęzi.",
  "While still inside of your local 'patchwork' repository, type {/cde/}git status{/cde_e/} to see what branch you're currently on. Git should reply that you're on the 'gh-pages' branch.": "Będąc wciąż w lokalnym repozytorium 'patchwork' repository, wpisz {/cde/}git status{/cde_e/} by sprawdzić na jakiej gałęzi jesteś obecnie. Git powinien odpowiedzieć, że jest to gałąź 'gh-pages'.",
  "Now create a new branch and name it {/add_branch/}, where 'username' is your username. For instance, {/add_jlord/}. {/str/}Branches are case-sensitive so name your branch exactly the way your GitHub name appears{/str_e/}.": "Teraz utwórz nową gałąź i nadaj jej nazwę {/add_branch/}, gdzie 'username' to Twoja nazwa użytkownika w serwisie GitHub, na przykład {/add_jlord/}. {/str/}Ponieważ nazwa gałęzi rozróżnia duże i małe litery pamiętaj o wprowadzeniu nazwy użytkownika dokładnie tak, jak widnieje w GitHub{/str_e/}.",
  "Now you have a branch with a new name that is identical to 'gh-pages'.": "Posiadasz nową gałąź identyczną ze starą o nazwie 'gh-pages'.",
  "To go into that branch and work on it you {/str/}checkout{/str_e/} a branch. Go on your new branch:": "Aby przełączyć się na nowo utworzoną gałąź i na niej pracować należy użyć opcji {/str/}checkout{/str_e/}. Przełącz się na nową gałąź:",
  "Step: Create a new file": "Krok: Tworzenie nowego pliku",
  "Back in your text editor:": "Wróć do swojego ulubionego edytora tekstowego:",
  "Create a new file named {/filename_add/}, where 'username' is your username. For instance, {/filename_jlord/}.": "Utwórz nowy plik nazwany {/filename_add/}, gdzie 'username' jest Twoją nazwą użytkownika, na przykład {/filename_jlord/}.",
  "Then, just write your GitHub username in it, that's it and that's all. For instance, I'd type 'jlord'.": "Następnie, jako jego zawartość wpisz swoją nazwę użytkownika w GitHub, tylko tyle i aż tyle. Przykładowo, wpisałbym 'jlord'.",
  "Save this file in the 'contributors' folder in Patchwork: {/str/}{/filepath/}{/str_e/}": "Zapisz ten plik w folderze 'contributors' w repozytorium lokalnym Patchwork: {/str/}{/filepath/}{/str_e/}",
  "Next, check in your changes (see below).": "Następnie zapisz zmiany w repozytorium (zobacz poniżej).",
  "Check-in": "Zapisywanie zmian",
  "Go through the steps for checking in a project: ": "Przejdź przez poniższe kroki by zapisać swoje zmiany: ",
  "Now push your update to {/str/}your fork{/str_e/}, 'origin', on GitHub:": "Teraz wypchnij swoje zmiany do {/str/}swojego forka{/str_e/}, 'origin', na GitHubie:",
  "Permission denied...error: 403": "Permission denied...error: 403",
  "You are pushing changes to a repository you don't have write access to. In this case, you're likely pushing to the original 'jlord/patchwork'. Make sure that you're pushing to 'origin' and that it points to your fork's address on GitHub. To check and see what your remotes are and where they point run {/cde/}git remote -v{/cde_e/}. You should have 'upstream' pointing to 'jlord/patchwork' and 'origin' pointing to 'yourusername/patchwork'.": "Wypychasz zmiany do repozytorium, w którym nie masz prawa zapisu. W tym wypadku, prawdopodobnie próbujesz wypchnąć zmiany do oryginalnego repozytorium 'jlord/patchwork'. Upewnij się, że 'pushujesz' do 'origin' oraz że repozytorium zdalne o tej nazwie kieruje do Twojego forka w GitHub. By sprawdzić listę repozytoriów zdalnych wraz z ich adresami uruchom polecenie {/cde/}git remote -v{/cde_e/} w terminalu. Powinieneś mieć repozytorium zdalne 'upstream' kierujące do 'jlord/patchwork' oraz 'origin' kierujące do 'NAZWAUŻYTKOWNIKA/patchwork'.",
  "To fix a remote that is pointing to the wrong place you can re-set its url: {/cde/}git remote set-url origin {/lt/}URLTOYOURFORK{/gt/}{/cde_e/}.": "By naprawić połączenia z repozytoriami zdalnymi kierujące pod niewłaściwy adres możesz ustawić ich adres URL ponownie: {/cde/}git remote set-url origin {/lt/}URLDOTWOJEGOFORKA{/gt/}{/cde_e/}..",
  "Authentication failed...error: 401": "Authentication failed...error: 401",
  "Your identity could not be verified. You may have 2FA (Two Factor Authentication) turned on in which case you must use a personal access token as your password. You can generate one by {/lnk_instr/}following these instructions{/lnk_e/}. You'll need to keep this and use it in place of your password when prompted. You can also {/lnk_save/}save this access token{/lnk_e/} on your computer so that you don't have to re-enter it.": "Twoja tożsamość nie mogła zostać zweryfikowana. Być może została uruchomiona weryfikacja dwuetapowa (2FA, Two Factor Authentication), w tym wypadku musisz uwierzytelnić się personalnym tokenem wprowadzając go jako hasło. Możesz wygenerować jeden {/lnk_instr/}podążając za tymi instrukcjami{/lnk_e/}. Pamiętaj by zapisać wygenerowany token i korzystać z niego zamiast hasła, kiedy będzie wymagane uwierzytelnienie. Możesz także {/lnk_save/}zapisać ten token{/lnk_e/} na swoim komputerze by nie musieć wpisywać go ponownie.",
  "File NOT in contributors folder": "Plik NIE znajdujący się w folderze 'contributors'",
  "The file you create should be placed inside the existing 'contributors' folder in the Patchwork repository. If you put it somewhere else, simply use Finder or Windows Explorer to move your file into the folder. You can check {/cde/}git status{/cde_e/} again and you'll find it sees your changes. Stage and then commit all of these changes (additions and deletions) with the commands below.": "Utworzony przez Ciebie plik powinien być umieszczony w istniejącym folderze 'contributors' w repozytorium Patchwork. Jeśli umieściłeś go gdzieś indziej, użyj Findera albo Eksploratora Windows by przenieść go we właściwe miejsce. Możesz zweryfikować status repozytorium ponownie za pomocą {/cde/}git status{/cde_e/} by zobaczyć swoje zmiany. Dodaj wszystkie (-A) zmiany do zatwierdzenia, a następnie zatwierdź je używając poleceń poniżej.",
  "Branch name expected: _____": "Branch name expected: _____",
  "The branch name should match your user name exactly. To change your branch name:": "Nazwa gałęzi powinna dokładnie odpowiadać Twojej nazwy użytkownika w GitHub. Zmień nazwę gałęzi:",
  "When you've made your updates, verify again!": "Kiedy to już zrobisz, zweryfikuj poprawność ponownie!",
  "You can create and switch to a branch in one line": "Tworzenie i zmiana aktualnej gałęzi jednym poleceniem",
  "Create a new branch": "Tworzenie nowej gałęzi",
  "Move onto a branch": "Zmiana aktualnej gałęzi",
  "List the branches": "Wypisanie wszystkich gałęzi",
  "Rename a branch you're currently on": "Zmiana nazwy aktualnej gałęzi",
  "Verify what branch you're working on": "Sprawdzenie aktualnej gałęzi"
}
