{
  "Add a collaborator to your project.": "Dodawanie współpracowników do swojego projektu.",
  "Social Coding": "Społeczne programowanie",
  "Working with others is one of the best things about GitHub because it is easier to work from any place or timezone with someone else.": "Pracowanie z innymi jest jedną z najlepszych rzeczy w GitHub, ponieważ łatwiej jest pracować z dowolnego miejsca o dowolnej porze z kimś innym.",
  "{/str/}Collaborators{/str_e/} are other GitHub users who are given permission to make edits to a repository owned by someone else. You may also hear the term {/str/}contributor{/str_e/}, this describes another GitHub user who has made contributions, through a Fork and Pull Request, to a project.": "{/str/}Współpracownicy{/str_e/} to inni użytkownicy GitHub, którzy posiadają uprawnienia do czynienia poprawek na rzecz repozytoriów będących w posiadaniu innej osoby (np. Ciebie). Często określani są także kontrybutorami ({/str/}contributor{/str_e/}), jest to określenie użytkownika, który dodał już coś od siebie, za pomocą forka i Pull Requesta, do projektu.",
  "{/lnk_reporobot/}@reporobot{/lnk_e/} is a robot from outer space that loves collaborating on repos.": "{/lnk_reporobot/}@reporobot{/lnk_e/} to robot pochodzący z przestrzeni kosmicznej, który uwielbia współpracować z innymi.",
  "Hello, Repo Robot!": "Cześć, Repo Robocie!",
  "To add collaborators to one of your projects, visit the repository's page on your GitHub account and click the 'Settings' tab in the menu in the upper part of the page. Then select the 'Manage access' option and click on 'Invite a collaborator'. Type the username into the text box, select the right user and finally add the collaborator to your repository by clicking the green button.": "To add collaborators to one of your projects, visit the repository's page on your GitHub account and click the 'Settings' tab in the menu in the upper part of the page. Then select the 'Manage access' option and click on 'Invite a collaborator'. Type the username into the text box, select the right user and finally add the collaborator to your repository by clicking the green button.",
  "{/str/}Now go to your forked Patchwork repository's page on GitHub and add 'RepoRobot' as a collaborator.{/str_e/} The URL should look like this, but with your own username.": "{/str/}Now go to your forked Patchwork repository's page on GitHub and add 'RepoRobot' as a collaborator.{/str_e/} The URL should look like this, but with your own username."
}
