{
  "Create a new repository on your computer.": "Crea un nuevo repositorio en tu ordenador.",
  "Repositories": "Repositorios",
  "A {/str/}repository{/str_e/} is a collection of related items. In our case, when writing software, it is a collection of files related to a software project. You can imagine it as a project folder with all the relevant files inside of it. In fact, that's what it will look like on your computer anyways. Sometimes they're called 'repos' for short.": "Un {/str/}repositorio{/str_e/} es una colección de elementos relacionados. En nuestro caso, cuando estamos escribiendo software, es una colección de archivos relacionados a un proyecto de software. Puedes imaginarlo como la carpeta de un proyecto con todos los archivos relevantes en su interior. De hecho, así es como se verá en tu ordenador de todas maneras. Algunas veces se les llama también \"repos\" como abreviación.",
  "You tell Git what your project is and Git will start tracking all of the changes to that folder. This makes it a Git repository: a folder of items being tracked by Git. Git tracks when files are added, subtracted or even a single letter in a single file is changed. All of this plus who did it and when is tracked by Git. In software, tracking changes like this is called {/str/}version control{/str_e/}.": "Le dices a Git qué carpeta contiene tu proyecto y Git empezará a hacer el seguimiento de todos los cambios en esa carpeta. Esto es lo que conforma un repositorio de Git: una carpeta de elementos que son seguidos por Git. Git hace seguimiento de cuándo se añaden archivos, cuándo se extraen e incluso cuándo una simple letra en un simple archivo ha sido cambiada. A todo esto Git le añade quién y cuándo lo hizo. En software, al proceso de hacer seguimiento a los cambios se le llama {/str/}control de versiones{/str_e/}.",
  "Using Terminal": "Usando la terminal (o consola)",
  "{/str/}Terminal{/str_e/} (or Bash) is a way to instruct your computer to do things by typing commands rather than clicking applications with your mouse. You can rename files, open files, create new folders, move between directories (folders) and more all by running typed commands. You can even use a text editor for code (like {/lnk_vim/}Vim{/lnk_e/}) in your terminal an never have to leave!": "La {/str/}terminal{/str_e/} (o bash, o consola, o línea de comandos) es la manera de decirle a tu ordenador que haga cosas escribiendo comandos en vez de haciendo clic en las aplicaciones con el ratón. Puedes renombrar archivos, abrir archivos, crear nuevas carpetas, moverte entre directorios (carpetas) y mucho más sólo con escribir comandos. ¡Puedes incluso usar un editor de texto para código (como {/lnk_vim/}Vim{/lnk_e/}) en tu terminal y y nunca dejar de usarla!",
  "Besides navigating your computer, you can also use programs in Terminal that have a {/str/}command-line interface (CLI){/str_e/}, meaning they can be run with commands in terminal. Git is one of these. The first part of the command lets your computer know you're talking to Git. The parts following that are the commands and the different options you want Git to act on.": "Además de navegar por los archivos de tu ordenador, puedes usar programas en la terminal que tienen {/str/}interfaz de línea de comandos (command-line interface o CLI){/str_e/}. Esto significa que pueden funcionar con comandos desde la terminal. Git es uno de estos. La primera parte del comando comunica a tu ordenador que le estás hablando a Git. Las siguientes partes son comandos y diferentes opciones que quieres Git haga.",
  "In Git-it you'll learn a few basic command-line actions (in addition to Git commands) for navigating your computer. They're described within the steps.": "En Git-it aprenderás algunas acciones de línea de comandos básicas (además de los comandos de Git) para navegar por tu ordenador; éstas se irán describiendo en los pasos según correspondan.",
  "Create a Repository": "Crear un repositorio",
  "You're going to create a new project folder and then initialize it as a Git repository. We'll name the folder 'hello-world' in this challenge, but you can choose a different name if you already have a folder named this (it's a common first project name).": "Vas a crear un nuevo proyecto en una carpeta y entonces iniciarás un repositorio de Git. Llamaremos la carpeta 'hola-mundo' en este reto, pero puedes elegir el nombre que quieras si ya tienes una carpeta con este nombre (es un nombre común para crear proyectos de prueba).",
  "Time to open your terminal!": "¡Es hora de abrir tu terminal!",
  "In your terminal window, type these commands, one at a time, pressing enter/return after each.": "En la ventana de tu terminal, escribe estos comandos, uno cada vez, y presionando Enter después de cada uno.",
  "First, make a new folder:": "Primero, crea una nueva carpeta:",
  "Tip: mkdir stands for {/em/}make directory{/em_e/}": "Ten en cuenta: mkdir hace referencia a {/em/}make directory{/em_e/} (crear directorio en inglés)",
  "Then go into that folder:": "Ahora vamos a situarnos dentro de la carpeta:",
  "Tip: cd stands for {/em/}change directory{/em_e/}": "Ten en cuenta: cd hace referencia a {/em/}change directory{/em_e/} (cambiar directorio en inglés)",
  "Finally, tell Git to initialize (start tracking) the folder you are now in:": "Finalmente, dile a Git que inicie (empiece el seguimiento) de la carpeta en la que estás actualmente:",
  "The last command should return something starting with 'Initialized empty Git repository'. The others commands do not return anything.": "El último comando debe devolver algo como \"Initialized empty Git repository\". Los otros comandos no tienen retorno, es decir, no devuelven ningún mensaje.",
  "You did it! If you want to be double-sure that it's a Git repository, type {/cde/}git status{/cde_e/} and if it doesn't return 'fatal: Not a git repository...', you're golden!": "¡Lo lograste! Si quieres asegurarte de que es un repositorio de Git, escribe {/cde/}git status{/cde_e/} y si no devuelve 'fatal: Not a git repository...', ¡está hecho!",
  "Make a new folder (aka make directory)": "Crear una nueva carpera (make directory)",
  "Navigate into an existing folder (aka change directory)": "Navegar o moverse hacia una carpeta existente (change directory)",
  "List the items in a folder": "Listar los contenidos de una carpeta",
  "Turn Git on for a folder": "Iniciar Git en una carpeta"
}
