{
  "Connect your local repository to a remote one and push changes to it.": "Conecta tu repositorio local a uno remoto y empuja (push) los cambios a este último.",
  "Remotes": "Remotos (remotes)",
  "When you put something on GitHub that copy lives on one of GitHub's servers. This makes it as {/str/}remote{/str_e/} repository because it is not on your computer, but on a server, {/dqm/}remote{/dqm/} and somewhere else. By {/str/}pushing{/str_e/} your {/str/}local{/str_e/} (on your computer) changes to it, you keep it up to date.": "Cuando pones algo en GitHub, esa copia vive en uno de los servidores de GitHub. Esto lo convierte en un repositorio {/str/}remoto (remote){/str_e/} porque no está en tu ordenador, está en un servidor {/dqm/}remoto{/dqm/} en algún otro lugar. {/str/}Empujando (pushing){/str_e/} tus cambios {/str/}locales{/str_e/} (los de tu ordenador) a éste, lo mantienes al día.",
  "Others can always then get the latest from your project by {/str/}pulling{/str_e/} your changes down from the remote (and onto their computer). This is how everyone can work on a project together without needing access to your computer where your local copy is stored.": "Otras personas siempre pueden obtener lo más reciente de tu proyecto {/str/}tirando (pulling){/str_e/} de tus cambios desde el remoto (a otro ordenador). Así es cómo varias personas pueden trabajar juntas en un proyecto sin necesidad de tener acceso a tu ordenador, donde está almacenada tu copia local.",
  "Create a Remote Repository": "Crear un repositorio remoto",
  "You want to sync your {/str/}local{/str_e/} version with one stored on GitHub.com. First create a new {/str/}remote{/str_e/} repository on GitHub.com.": "Si quieres sincronizar tu versión {/str/}local{/str_e/} con la que está guardada en GitHub.com, primero crea un nuevo repositorio {/str/}remoto (remote){/str_e/} en GitHub.com.",
  "Go to {/lnk_github/}github.com{/lnk_e/}, log in, and click the '+' in the top right and then click 'New repository'.": "Ve a {/lnk_github/}github.com{/lnk_e/}, haz login, y haz clic en el '+' situado arriba a la derecha y después en 'Nuevo repositorio' ('New repository').",
  "Give it a name that matches your local repository's name, 'hello-world', and a short description.": "Dale un nombre que coincida con el nombre de tu repositorio local, 'hola-mundo', y una descripción corta.",
  "Make it public. This means it'll be listed on your public profile.": "Hazlo público. Esto significa que será listado en tu perfil público.",
  "Don't initialize with a README because we already have a file, locally, named 'readme.txt'. This is a helper option from GitHub if you hadn't already made it.": "No inicialices con un archivo README porque ya tienes un archivo, localmente, llamado 'readme.txt'. Esta opción es una ayuda de GitHub si todavía no has creado uno local en tu ordenador.",
  "Leave '.gitignore' and 'license' set to 'none'. We won't use them this tutorial.": "Las opciones '.gitignore' and 'license' deben quedar en 'none' (ninguna). No las usaremos en este tutorial.",
  "Click create repository!": "Haz clic en 'Create Repository' (crear repositorio).",
  "Readmes, .gitignores and Licenses": "Readmes, .gitignores y Licenses",
  "These are common files in open source projects so to make starting a new project easier, GitHub provides an option for creating them for you.": "Estos son archivos comunes en proyectos de código abierto, así que para iniciar un proyecto más fácilmente, GitHub ofrece una opción para crearlos por ti.",
  "A {/str/}readme{/str_e/} explains what the project is, how to use it, and often times, how to contribute (though sometimes there is an extra file, 'CONTRIBUTING.md', for those details).": "Un {/str/}README{/str_e/} describe lo que es el proyecto, cómo usarlo y, generalmente, cómo contribuir al mismo (algunas veces hay un archivo extra, 'CONTRIBUTING.md', para estos últimos detalles).",
  "A {/str/}.gitignore{/str_e/} is a list of files that Git should {/em/}not{/em_e/} track, for instance, files with passwords!": "Un {/str/}.gitignore{/str_e/} es una lista de archivos a los que Git {/em/}no{/em_e/} debería hacer seguimiento, por ejemplo, ¡archivos con contraseñas!",
  "A {/str/}license{/str_e/} file is the type of license you put on your project. This lets others know how they can use it. Information on the types is here: {/lnk_license/}choosealicense.com{/lnk_e/}.": "Un archivo {/str/}license{/str_e/} describe el tipo de licencia que pusiste en tu proyecto. Esto permite a otros saber cómo pueden usarlo. Puedes encontrar más información de los tipos de licencia en: {/lnk_license/}choosealicense.com{/lnk_e/}.",
  "Connect your Local to your Remote": "Conecta tu Local a tu Remoto",
  "Now you've got an empty repository started on GitHub.com. At the top you'll see 'Quick Setup', make sure the 'HTTPS' button is selected and copy the address—this is the address of your repository on GitHub's servers.": "Ahora que has iniciado un repositorio remoto en GitHub.com, en la parte de arriba puedes ver una 'configuración rápida' ('Quick Setup'). Asegúrate de que el botón 'HTTPS' está seleccionado y copia la dirección, que es la dirección de tu repositorio en los servidores de GitHub.",
  "Back in your terminal, and inside of the 'hello-world' folder that you initialized as a Git repository in the earlier challenge, you want to tell Git to remember the address of the remote version on GitHub's servers. You can have multiple remotes so each requires a name. The primary remote is typically named {/cde/}origin{/cde_e/}.": "Vuelve a la terminal, y situado dentro de la carpeta 'hola-mundo' que inicializaste como repositorio de Git en el reto anterior, vas a decirle a Git que recuerde la dirección de la versión remota en los servidores GitHub. Puedes tener varios remotos configurados en tu ordenador local, por lo que el remoto necesita un nombre. El remoto principal es generalmente llamado {/cde/}origin{/cde_e/}.",
  "To add a remote named 'origin' to your repository:": "Para agregar un remoto llamado 'origin' a tu repositorio:",
  "Your {/str/}local{/str_e/} repository now knows where your {/str/}remote{/str_e/} repository, named 'origin', lives on GitHub's servers. Think of it as adding a name and address on speed dial—now when you need to send something there, you can.": "Tu repositorio {/str/}local{/str_e/} ahora sabe dónde está tu repositorio {/str/}remoto{/str_e/}, llamado 'origin', que está ubicado en los servidores de GitHub. Piensa en esto como si añadieras un nombre y un número de teléfono en los contactos de tu teléfono móvil para llamarlos rápidamente cada vez que te haga falta.",
  "Windows Users:": "Usuarios de Windows:",
  "If you have {/str/}GitHub Desktop{/str_e/} on your computer, a remote named 'origin' is automatically created in your local repository. In that case, you'll just need to tell it what URL to associate with 'origin'. Use this command instead of the 'add' one above:": "Si tienes {/str/}GitHub Desktop{/str_e/} en tu ordenador, un remoto llamado 'origin' se crea automáticamente en tu repositorio local. En este caso, sólo necesitarás decirle qué URL asociar con 'origin'. Para esto, en vez de usar el comando 'add' mencionado anteriormente, utiliza el siguiente:",
  "Push Work to your Remote": "Empuja (push) tu trabajo al remoto",
  "Next you want to {/str/}push{/str_e/} (send) everything you've done locally to your remote repository on GitHub. This is something you'll do often so that your remote version is up to date and matching the state of your local version.": "Lo siguiente es hacer {/str/}push{/str_e/} (empujar) todo lo que has hecho localmente a tu repositorio remoto en GitHub. Esto es algo que harás con frecuencia para que tu versión remota esté al día y coincida con el estado tu versión local.",
  "Git has a branching system so that you can work on different parts of a project at different times. We'll learn more about that later, but by default the first branch is named 'master'. When you push (and later pull) from a project, you tell Git the {/str/}branch name{/str_e/} you want and the name of the {/str/}remote{/str_e/} that it lives on.": "Git tiene un sistema de ramas (branches) para que puedas trabajar en diferentes partes del proyecto en tiempos diferentes. Aprenderemos más acerca de ello después, pero por defecto la primera branch es nombrada 'master'. Cuando empujas (push) (y más adelante tiras) desde un proyecto, le dices a Git el {/str/}nombre de la rama (branch name){/str_e/} que quieres y el nombre del {/str/}remoto{/str_e/} en el que debe residir.",
  "In this case, we'll send our branch named 'master' to our remote on GitHub named 'origin'.": "En este caso, vamos a enviar una rama llamada 'master' a nuestro remoto en GitHub llamado 'origin'.",
  "Now go to your remote repository's page on GitHub.com and refresh the page. {/str/}Wow!{/str_e/} Everything is now the same locally as it is remotely. Congrats on your first public repository!": "Ahora ve a la página de tu repositorio remoto en GitHub.com y actualízala. {/str/}¡Wow!{/str_e/} Todo es lo mismo ahora en tu ordenador local y remotamente en GitHub. Felicidades, ¡has creado tu primer repositorio público!",
  "Add remote connections": "Agregar conexiones remotas",
  "Set a URL to a remote": "Modificar la URL de un remoto",
  "Pull in changes": "Tirar de los cambios",
  "View remote addresses": "Ver las direcciones remotas",
  "Push changes": "Empujar cambios"
}
