{
  "Fork a project from GitHub.com and clone it locally.": "Bifurca (fork) un proyecto desde GitHub.com y clónalo localmente.",
  "Forks": "Bifurcaciones (forks)",
  "So far you have made a project locally and pushed it to GitHub, but that's only half the fun! The other half is working with other people and other projects.": "Hasta ahora has creado un proyecto local y lo has subido a GitHub, ¡pero esto es sólo la mitad de la diversión! La otra mitad está con otras personas y otros proyectos.",
  "When you {/str/}fork{/str_e/} a repository, you're creating a copy of it on your GitHub account. Your forked copy begins its life as a {/str/}remote{/str_e/} repository — it exists just on your GitHub account, not on your computer. Forks are used for creating your own version of a project (this diversion from the original is like taking a fork in the road) or contributing back your changes (such as bug fixes or new features) to the original project.": "Cuando {/str/}bifurcas (fork){/str_e/} un repositorio, estás creando una copia del mismo en tu cuenta de GitHub. Tu copia bifurcada empieza su vida como un repositorio {/str/}remoto{/str_e/} que sólo existe en tu cuente de GitHub, no en tu ordenador. Las bifurcaciones (forks) son usadas para crear tu propia versión de un proyecto (esta división es como tomar una bifurcación cuando vas por una carretera) o contribuir con tus cambios (como solucionar errores o añadir nuevas funcionalidades) al proyecto original.",
  "To get a forked repository from your GitHub account onto your computer you {/str/}clone{/str_e/} it. This cloning action copies the remote repository onto your computer so that you can work on it locally.": "Para conseguir una copia de tu bifurcación en GitHub a tu ordenador, tienes que {/str/}clonar (clone){/str_e/} el proyecto. La acción de clonar copia el repositorio remoto en tu ordenador para que puedas trabajar localmente.",
  "Fork the Patchwork Repository": "Bifurca (fork) el repositorio Patchwork",
  "The project we'll work with is at {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. Go to that page and click the 'Fork' button at the top right. Once the forking animation is complete, you have a copy on your account. Copy your fork's HTTP URL from the address bar in your browser, this is the address of your fork on GitHub's servers.": "El proyecto con el que vamos a trabajar está en {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}. Ve a esa paǵina y haz clic en el botón 'Fork' arriba a la derecha. Una vez finalizada la animación de bifurcación en la página, tienes una copia en tu cuenta. Copia la dirección HTTP de tu fork desde la barra de direcciones del navegador, esta es la dirección de tu fork en los servidores de GitHub.",
  "Clone Your Fork Locally": "Clona tu fork localmente",
  "Now, in terminal, you'll clone the repository onto your computer. It will automatically create a new folder for the repository so there is no need to create one yourself. But make sure you aren't cloning it inside of another Git repository folder!": "Volvemos a la terminal para clonar el repositorio en tu ordenador. Automáticamente, esto creará una nueva carpeta para el repositorio, así que no tienes necesidad de crear una manualmente. ¡Asegúrate de que no estás clonándolo dentro de otra carpeta con otro repositorio de Git!",
  "So be sure you're not inside of the 'hello-world' directory from the previous challenges. To back out and leave this folder so that you can clone, follow these steps:": "Comprueba, por lo tanto, que no estás dentro del directorio de 'hola-mundo' de los anteriores retos. Para abandonar esa carpeta para que puedas clonar el nuevo repositorio, sigue los pasos a continuación:",
  "Back out of your 'hello-world' folder:": "Para salir de la carpeta 'hola-mundo':",
  "Tip: the two dots mean step out of a directory one level": "Consejo: los dos puntos significan un nivel superior del directorio actual",
  "Now that you're no longer in another Git repository, clone your fork:": "Ahora que ya no estás en un repositorio de Git, clona tu fork:",
  "Go into the folder it created for your local copy of the fork (in this case, named 'patchwork').": "Ve a la carpeta creada para el fork (en este caso se debería llamar 'patchwork').",
  "Now you've got a copy of the repository on your computer and it is automatically connected to the remote repository (your forked copy) on your GitHub account. Type {/cde/}git remote -v{/cde_e/} to see that the address to the fork is already set up.": "Ahora que tienes una copia del repositorio en tu ordenador y está automaticamente conectada a el repositorio remoto (tu copia bifurcada) en tu cuenta de GitHub, escribe {/cde/}git remote -v{/cde_e/} para ver las direcciones que el fork ya tiene configuradas.",
  "Connect to the Original Repository": "Conectar con el repositorio original",
  "What if the original repository you forked happens to change? You'll want to be able to {/str/}pull{/str_e/} in those changes too. So let's add another remote connection, this time to the original, {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}, repository with its URL.": "¿Qué pasa si el repositorio original tiene cambios nuevos? Vas a querer tenerlos y {/str/}tirar (pull){/str_e/} de esos cambios. Para eso agregaremos otra conexión remota, esta vez la original, {/lnk_patchwork/}github.com/jlord/patchwork{/lnk_e/}, con su URL.",
  "You can name this remote connection anything you want, but typically people use the name 'upstream'{/smc/} let's use that for this.": "Puedes ponerle el nombre que quieras a esta conexión remota, pero normalmente la gente usa 'upstream' como nombre{/smc/} usemos ese nombre para esto.",
  "To be sure you have the correct remotes set up, type {/cde/}git remote -v{/cde_e/} to list out the addresses you have stored. {/str/}You should have an 'origin' remote with your fork's address and then an 'upstream' remote with the address to the original, the URL noted above in this step.{/str_e/}": "Para asegurarnos de que tienes correctamente configuradas las conexiones remotas, escribe {/cde/}git remote -v{/cde_e/} para listar las direcciones que tienes guardadas. {/str/}Derías tener un remoto con nombre 'origin' con la dirección remota de tu fork y otro con el nombre 'upstream' con la dirección del remoto original, es decir, la URL que está encima de este párrafo.{/str_e/}",
  "Add a remote": "Agregar un remoto",
  "Change a remote URL": "Cambiar la URL a un remoto",
  "View remote connections": "Ver las conexiones remotas"
}
