{
  "Install Git on your computer and configure your name and email.": "Installiere Git und konfiguriere deinen Namen und deine Email-Adresse.",
  "Git": "Git",
  "Git is free {/str/}open source software{/str_e/} (the {/lnk_git/}source code is public{/lnk_e/}) written by Linus Torvalds who also wrote the Linux operating system's kernel.": "Git ist eine kostenfreie {/str/}Open-Source Software{/str_e/} (der {/lnk_git/}Quellcode ist frei verfügbar{/lnk_e/}), entwickelt von Linus Torvalds, der auch den Linux Betriebssystem-Kernel geschrieben hat.",
  "Git is a program for keeping track of changes over time, known in programming as {/str/}version control{/str_e/}. If you've used a track changes feature in a text editing software then you're already familiar with the concept!": "Es handelt sich dabei um eine Software zur {/str/}Versionsverwaltung{/str_e/}, die Dateiänderungen im Verlauf der Zeit nachverfolgt und protokolliert. Wenn du schon einmal eine \"Änderungen nachverfolgen\"-Funktion in einem Textverarbeitungsprogramm verwendet hast, ist dir dieses Konzept bereits bekannt!",
  "Install Git": "Git installieren",
  "We recommend installing Git on your computer by downloading the {/lnk_desktop/}GitHub Desktop{/lnk_e/} app. We'll not use the desktop app in Git-it (we're learning terminal!) but it includes Git and is the easiest way to install Git on all platforms in the same way.": "Wir empfehlen, Git auf dem Computer mittels der {/lnk_desktop/}GitHub Desktop{/lnk_e/} App zu installieren. Wir werden die Desktop-App in Git-it nicht verwenden (wir lernen im Terminal!), aber es enthält Git und ist der einfachste Weg, um Git auf allen Plattformen auf die gleiche Weise zu installieren.",
  "{/str/}Windows{/str_e/}: Use the {/str/}Git Shell{/str_e/} for your terminal.": "{/str/}Windows{/str_e/}: Benutze {/str/}Git Bash{/str_e/} als Terminal.",
  "{/str/}Mac{/str_e/}: Open GitHub Desktop and from Preferences, select the command line tools install. Use the {/str/}terminal{/str_e/} app as your terminal.": "{/str/}Mac{/str_e/}: Öffne GitHub Desktop und wähle in den Einstellungen, die Installation der Kommandozeilen-Tools. Benutze die{/str/}Terminal{/str_e/} App als Terminal.",
  "Already have Git or not sure? Type {/cde/}git --version{/cde_e/} in your terminal and if it returns a version number higher than {/cde/}1.7.10{/cde_e/}, you're set! For more information, visit the {/lnk_git/}Git website{/lnk_e/}.": "Du hast Git schon installiert oder bist dir nicht sicher? Tippe {/cde/}git --version{/cde_e/} im Terminal ein. Wenn du in der Ausgabe eine Versions-Nummer größer als {/cde/}1.7.10{/cde_e/} siehst, ist die passende Software installiert. Weitere Informationen dazu findest du auf der {/lnk_git/}Git Webseite{/lnk_e/}.",
  "Git Software": "Git Software",
  "The GitHub Desktop app can do a lot of things with Git but not all, which is why learning the terminal is important. But once you've got that down, you'll be glad to have the desktop app because it organizes your project's information more visually, like the GitHub website.": "Die GitHub Desktop App kann viele Dinge mit Git tun, allerdings auch nicht alles. Daher ist es wichtig, auch mit dem Terminal umgehen zu können. Aber wenn du die Grundlagen einmal verstanden hast, wirst du dich freuen die Desktop-App zu haben, da sie die Informationen etwas übersichtlicher darstellt, ähnlich wie die GitHub Webseite.",
  "Git on its own isn't like other programs on your computer. You'll likely not see an icon on your desktop, but it will always be available to you and you'll be able to access it at anytime from your terminal or Git desktop applications.": "Git selbst ist kein typisches Programm auf dem Computer. Für Git selbst gibt es kein Desktop-Symbol oder eine Benutzerobefläche, aber trotzdem wird Git immer für dich verfügbar sein. Du wirst es aus dem Terminal oder mittels anderer Benutzerobeflächen nutzen können.",
  "Configure Git": "Git konfigurieren",
  "Once GitHub Desktop (and therefore Git) is installed, open your {/str/}terminal{/str_e/}. You can verify that Git is really there by typing:": "Wenn GitHub Desktop (und somit Git) installiert ist, öffne dein {/str/}Terminal{/str_e/}. Du kannst die Installation von Git mit dem folgenden Befehl prüfen:",
  "This will return the version of Git on your computer and look something like this:": "Dies gibt dir die Versions-Nummer deiner Git-Installation zurück und sollte in etwa so aussehen:",
  "Next, configure Git so it knows to associate your work to you:": "Nun kannst du Git so konfigurieren, dass es deine Arbeit mit dir verknüpfen kann.",
  "Set your name:": "Konfiguriere deinen Namen:",
  "Now set your email:": "Konfiguriere deine Mail-Adresse:",
  "You're done with your first challenge! Click the 'Verify' button to check the challenge.": "Damit hast du die erste Aufgabe erledigt! Klicke auf den 'Prüfen'-Button, um deine Arbeit zu kontrollieren.",
  "Dollar Signs in Code Documentation": "Dollar-Zeichen in der Code-Dokumentation",
  "Dollar signs {/cde/}${/cde_e/} are often used in programming documentation to signify that the line is {/str/}command line{/str_e/} code (see the code snippets above). You don't actually type the {/cde/}${/cde_e/} in though, only type what comes after.": "Dollar-Zeichen {/cde/}${/cde_e/} werden in Programm-Dokumentationen oft verwendet um {/str/}Kommandozeilen-Code{/str_e/} zu markieren (vgl. die Code-Schnipsel oben). Das {/cde/}${/cde_e/} wird dann nicht in die Kommandozeile übernommen, nur der darauf folgende Text wird verwendet."
}
