{
  "Create a file in your new repository, add something to that file and commit that change with Git.": "Erzeuge eine Datei in deinem neuen Repository, füge Text in die Datei ein und übergib diese Änderungen an Git.",
  "Commits": "Commits",
  "Commits are core to using Git. They are the moments in which you save and describe the work you've done. They are the ticks in the timeline of your project's history.": "Commits ('to commit' - dt. etw. begehen/übergeben/überlassen) sind weitere Kernbestandteile der Git-Struktur. Sie bezeichnen Momentaufnahmen, die gespeichert werden und beschreiben somit im Verlauf die Änderungen die gemacht wurden. Auf einem Zeitstrahl der Projekt-Historie beschreiben Commits die markierten Zeitpunkte, deren zugehörige Momentaufnahmen gespeichert sind.",
  "Create a New File": "Erzeuge eine neue Datei",
  "Now that you've got a repository started let's add a file to it.": "Da du nun ein Git-Repository besitzt, können wir damit beginnen eine Datei hinzuzufügen.",
  "Open your text editor and create a new empty file. Now write a little bit of text, perhaps type {/dqm/}Hello!{/dqm/}, and save the file as 'readme.txt' in the 'hello-world' folder you created in the last challenge.": "Öffne dazu in einem einfachen Texteditor eine neue Datei. Schreibe ein bisschen Text, z.B. {/dqm/}Hallo!{/dqm/} und speichere die Datei als 'readme.txt' in den 'hello-world' Ordner, den du in der letzten Aufgabe erstellt hast.",
  "Check Status + Add and Commit Changes": "Überprüfe den Status und übergib die Änderungen an Git",
  "Next check the {/str/}status{/str_e/} of your repository to find out if there have been changes. You know you have changed something, but does Git?": "Als nächstes, überprüfe den {/str/}Status{/str_e/} deines Repositorys um herauszufinden, ob dort etwas geändert wurde. Du weißt natürlich, dass du etwas geändert hast. - Aber weiß Git das auch?",
  "Make sure you're still within your 'hello-world' directory when you're running these commands. Use Git to see what changed in your repository:": "Stelle dazu sicher, dass du noch immer in deinem \"hello-world\" Verzeichnis arbeitest, wenn du die folgenden Kommandos ausführst. Benutze Git um zu sehen, was sich in deinem Repository verändert hat:",
  "First, check the status:": "Zuerst, überprüfe den Status:",
  "Git should tell you that a file has been added.": "Git sollte dir nun sagen, dass eine neue Datei hinzugefügt wurde.",
  "Then {/str/}add{/str_e/} the file you just created so that it becomes a part of the changes you will {/str/}commit{/str_e/} (aka save) with Git:": "Als nächstes, füge die Datei hinzu (engl. {/str/}add{/str_e/}), damit sie Teil der Änderungen wird, die du mit Git sichern bzw. an Git übergeben ({/str/}commit{/str_e/}) wirst:",
  "Finally, {/str/}commit{/str_e/} those changes to the repository's history with a short (m) message describing the updates.": "Nun übergib ({/str/}commit{/str_e/}) diese Änderungen an die Historie deines Repository, gemeinsam mit einer kurzen Nachricht (engl. message - m), die deine Änderungen beschreibt.",
  "Step: Make More Changes": "Nächster Schritt: Verändere deine Datei",
  "Now add another line to 'readme.txt' and save the file again.": "Füge nun deiner Datei 'readme.txt' eine weitere Zeile Text hinzu und speichere die Änderungen.",
  "In terminal, you can view the {/str/}diff{/str_e/}erence between the file now and how it was at your last commit.": "Im Terminal kannst du dir nun den Unterschied (engl. {/str/}diff{/str_e/}erence) zwischen der aktuellen Datei und der Datei zum Zeitpunkt deines letzten Commit anzeigen lassen.",
  "Tell Git to show you the {/str/}diff{/str_e/}:": "Befehle Git, dir den Unterschied ({/str/}diff{/str_e/}) anzuzeigen:",
  "Now with what you just learned above, commit this latest change.": "Übergib nun deine Änderungen an die Projekt-Historie, so wie du es zuvor gelernt hast.",
  "Check status of changes to a repository": "Überprüfe den Status der Veränderungen deines Repository",
  "View changes to files": "Lass dir die Unterschiede anzeigen",
  "Add a file's changes to be committed": "Füge die Änderungen an einer Datei zum nächsten Commit hinzu.",
  "To add all files changes": "Um alle geänderten Dateien hinzuzufügen",
  "To commit (aka save) the changes you've added with a short message describing the changes": "Erzeuge einen Commit (bzw. speichere) die Änderungen mit einer kurzen Nachricht zur Beschreibung"
}
