{
  "Connect your local repository to a remote one and push changes to it.": "Connectez votre dépôt local à votre dépôt distant et y pousser vos modifications.",
  "Remotes": "Remotes",
  "When you put something on GitHub that copy lives on one of GitHub's servers. This makes it as {/str/}remote{/str_e/} repository because it is not on your computer, but on a server, {/dqm/}remote{/dqm/} and somewhere else. By {/str/}pushing{/str_e/} your {/str/}local{/str_e/} (on your computer) changes to it, you keep it up to date.": "Lorsque vous mettez quelque chose sur GitHub, cette copie vit sur l'un des serveurs de GitHub. Cela en fait une copie {/str/}distante (remote){/str_e/} car elle n'est pas sur votre ordinateur, mais sur un serveur {/dqm/}distant{/dqm/}. En {/str/}poussant (push){/str_e/} les modifications de votre dêpot {/str/}local{/str_e/} (celui sur votre ordinateur) sur votre \"remote\" maintenez à jour la copie partagée.",
  "Others can always then get the latest from your project by {/str/}pulling{/str_e/} your changes down from the remote (and onto their computer). This is how everyone can work on a project together without needing access to your computer where your local copy is stored.": "Les autres peuvent toujours obtenir la derniere version de votre projet en {/str/}tirant (pull){/str_e/} vos modifications à partir de votre remote. C'est ainsi que chacun peut travailler sur un projet sans avoir besoin d'accéder à votre ordinateur où votre copie locale est stockée.",
  "Create a Remote Repository": "Créer un dépôt distant",
  "You want to sync your {/str/}local{/str_e/} version with one stored on GitHub.com. First create a new {/str/}remote{/str_e/} repository on GitHub.com.": "Vous voulez synchroniser votre version {/str/}local{/str_e/} avec celle enregistrée sur GitHub.com. Créez d'abord un dépôt {/str/}distant (remote){/str_e/} sur GitHub.com.",
  "Go to {/lnk_github/}github.com{/lnk_e/}, log in, and click the '+' in the top right and then click 'New repository'.": "Allez à {/lnk_github/}github.com{/lnk_e/}, connectez-vous, puis cliquez sur '+' dans le haut À droite, puis cliquez sur 'New repository'.",
  "Give it a name that matches your local repository's name, 'hello-world', and a short description.": "Donnez-lui un nom qui correspond au nom de votre dépôt local, 'hello-world', et une brève description.",
  "Make it public. This means it'll be listed on your public profile.": "Rendez-le public. Cela signifie qu'il sera répertorié sur votre profil public.",
  "Don't initialize with a README because we already have a file, locally, named 'readme.txt'. This is a helper option from GitHub if you hadn't already made it.": "Ne pas initialiser avec un README car nous avons déjà un fichier, localement, nommé \"readme.txt\". Cette option de GitHub peut vous aider si vous ne l'aviez pas encore fait.",
  "Leave '.gitignore' and 'license' set to 'none'. We won't use them this tutorial.": "Laissez «.gitignore» et «licence» définis sur «none». Nous n'utiliserons pas ces options dans ce tutoriel.",
  "Click create repository!": "Cliquer enfin sur \"create repository\"!",
  "Readmes, .gitignores and Licenses": "Readmes, .gitignores and Licenses",
  "These are common files in open source projects so to make starting a new project easier, GitHub provides an option for creating them for you.": "Ce sont des fichiers communs dans les projets open source afin de faciliter le démarrage d'un nouveau projet, GitHub fournit une option pour les créer pour vous.",
  "A {/str/}readme{/str_e/} explains what the project is, how to use it, and often times, how to contribute (though sometimes there is an extra file, 'CONTRIBUTING.md', for those details).": "Un {/str/}readme{/str_e/} décrit le projet, comment l'utiliser, et souvent, comment y contribuer (bien que parfois il y ait aussi un fichier 'CONTRIBUTING.md' pour ces informations).",
  "A {/str/}.gitignore{/str_e/} is a list of files that Git should {/em/}not{/em_e/} track, for instance, files with passwords!": "Le fichier {/str/}.gitignore{/str_e/} est une liste de fichiers que Git devrait {/em/}ne pas{/em_e/} suivre, par exemple, les fichiers avec des mots de passe!",
  "A {/str/}license{/str_e/} file is the type of license you put on your project. This lets others know how they can use it. Information on the types is here: {/lnk_license/}choosealicense.com{/lnk_e/}.": "Le fichier {/str/}licence{/str_e/} est le type de licence que vous avez utilisé pour votre projet. Cela permet aux autres de savoir comment votre contenu peut être utilisé. Les informations sur les types de licences sont trouvable sur la page suivante: {/lnk_license/}choosealicense.com{/lnk_e/}.",
  "Connect your Local to your Remote": "Connectez votre dépôt local à votre remote",
  "Now you've got an empty repository started on GitHub.com. At the top you'll see 'Quick Setup', make sure the 'HTTPS' button is selected and copy the address—this is the address of your repository on GitHub's servers.": "Maintenant, vous avez créé un dépôt vide sur GitHub.com. En haut, vous verrez 'Configuration rapide', assurez-vous que le bouton \"HTTPS\" soit sélectionné et copiez l'adresse: c'est l'adresse de votre dépôt Git sur les serveurs de GitHub.",
  "Back in your terminal, and inside of the 'hello-world' folder that you initialized as a Git repository in the earlier challenge, you want to tell Git to remember the address of the remote version on GitHub's servers. You can have multiple remotes so each requires a name. The primary remote is typically named {/cde/}origin{/cde_e/}.": "Retour dans votre terminal, et à l'intérieur du dossier 'hello-world' que vous avez initialisé en tant que dépôt Git dans les défis précédents. Vous voulez que Git retienne l'adresse de la version à distance présente sur les serveurs de GitHub. Vous pouvez avoir plusieurs remotes, pour les différencier, chacun a un nom. Le remote principal est généralement appelé {/cde/}origin{/cde_e/}.",
  "To add a remote named 'origin' to your repository:": "Pour ajouter une télécommande nommée 'origin' à votre dépôt:",
  "Your {/str/}local{/str_e/} repository now knows where your {/str/}remote{/str_e/} repository, named 'origin', lives on GitHub's servers. Think of it as adding a name and address on speed dial—now when you need to send something there, you can.": "Votre dépôt {/str/}local{/str_e/} sait maintenant où votre {/str/}référentiel distant (remote){/str_e/}, nommé 'origin', se trouve sur les serveurs de GitHub. Pensez-y comme ajout d'un nom et d'une adresse sur la numérotation rapide, maintenant lorsque vous devez envoyer quelque chose là-bas, vous le pouvez.",
  "Windows Users:": "Utilisateurs Windows:",
  "If you have {/str/}GitHub Desktop{/str_e/} on your computer, a remote named 'origin' is automatically created in your local repository. In that case, you'll just need to tell it what URL to associate with 'origin'. Use this command instead of the 'add' one above:": "Si vous avez {/str/}GitHub Desktop{/str_e/} sur votre ordinateur, une remote nommée 'origin' est automatiquement créé dans votre dépôt local. Dans ce cas, vous devrez préciser l'URL à associer à 'origin'. Utilisez cette commande au lieu du 'add' ci-dessus:",
  "Push Work to your Remote": "Poussez votre travail dans votre remote",
  "Next you want to {/str/}push{/str_e/} (send) everything you've done locally to your remote repository on GitHub. This is something you'll do often so that your remote version is up to date and matching the state of your local version.": "Ensuite, {/str/}poussez (envoyez, push){/str_e/} tout ce que vous avez effectué localement dans votre dépôt distant sur GitHub. C'est quelque chose que vous ferez souvent pour que votre version à distance soit à jour et synchronisée avec l'état de votre version locale.",
  "Git has a branching system so that you can work on different parts of a project at different times. We'll learn more about that later, but by default the first branch is named 'master'. When you push (and later pull) from a project, you tell Git the {/str/}branch name{/str_e/} you want and the name of the {/str/}remote{/str_e/} that it lives on.": "Git dispose d'un système de branche afin que vous puissiez travailler sur différentes parties d'un projet à différents moments. Nous allons apprendre plus à ce propos par la suite, mais par défaut, la première branche est nommée «master». Lorsque vous poussez (et tirez plus tard) d'un projet, vous dites à Git le {/str/}nom de branche{/str_e/} que vous voulez ainsi que le nom du {/str/}remote{/str_e/} avec lequel vous voulez travailler.",
  "In this case, we'll send our branch named 'master' to our remote on GitHub named 'origin'.": "Dans ce cas, nous enverrons notre branche nommée 'master' à notre remote sur GitHub nommée 'origin'.",
  "Now go to your remote repository's page on GitHub.com and refresh the page. {/str/}Wow!{/str_e/} Everything is now the same locally as it is remotely. Congrats on your first public repository!": "Maintenant, accédez à la page de votre dépôt sur GitHub.com et actualisez la page. {/str/}Wow!{/str_e/} votre dépôt distant est à jour avec le local. Félicitation vous avez créé votre premier dépôt public!",
  "Add remote connections": "Ajouter un remote",
  "Set a URL to a remote": "Modifier l'URL d'un remote",
  "Pull in changes": "Tirer des changement à partir d'un remote",
  "View remote addresses": "Afficher l'adresse d'un remote",
  "Push changes": "Pousser des modifications"
}
