{
  "Add a collaborator to your project.": "Ajoutez un collaborateur à votre projet.",
  "Social Coding": "Social Coding",
  "Working with others is one of the best things about GitHub because it is easier to work from any place or timezone with someone else.": "Travailler avec les autres est l'une des meilleures fonctionnalité de GitHub. Grâce à cet outil, il est plus simple de travailler avec quelqu'un d'autre quelque soit l'endroit ou le fuseau horaire.",
  "{/str/}Collaborators{/str_e/} are other GitHub users who are given permission to make edits to a repository owned by someone else. You may also hear the term {/str/}contributor{/str_e/}, this describes another GitHub user who has made contributions, through a Fork and Pull Request, to a project.": "Les {/str/}collaborateurs{/str_e/} sont d'autres utilisateurs de GitHub autorisés à effectuer des modifications dans un dépôt appartenant à quelqu'un d'autre. Vous pouvez également voir le terme {/str/}contributeurs{/str_e/}, il désigne un autre utilisateur GitHub qui a apporté des contributions, par le biais d'un fork et de 'Pull Request'.",
  "{/lnk_reporobot/}@reporobot{/lnk_e/} is a robot from outer space that loves collaborating on repos.": "{/lnk_reporobot/}@reporobot{/lnk_e/} est un robot de l'espace extra-atmosphérique qui aime collaborer sur les repos.",
  "Hello, Repo Robot!": "Salut, Repo Robot!",
  "To add collaborators to one of your projects, visit the repository's page on your GitHub account and click the 'Settings' tab in the menu in the upper part of the page. Then select the 'Manage access' option and click on 'Invite a collaborator'. Type the username into the text box, select the right user and finally add the collaborator to your repository by clicking the green button.": "To add collaborators to one of your projects, visit the repository's page on your GitHub account and click the 'Settings' tab in the menu in the upper part of the page. Then select the 'Manage access' option and click on 'Invite a collaborator'. Type the username into the text box, select the right user and finally add the collaborator to your repository by clicking the green button.",
  "{/str/}Now go to your forked Patchwork repository's page on GitHub and add 'RepoRobot' as a collaborator.{/str_e/} The URL should look like this, but with your own username.": "{/str/}Now go to your forked Patchwork repository's page on GitHub and add 'RepoRobot' as a collaborator.{/str_e/} The URL should look like this, but with your own username."
}
