{
  "Create a new repository on your computer.": "Créez un nouveau dépôt sur votre ordinateur.",
  "Repositories": "Dépôts",
  "A {/str/}repository{/str_e/} is a collection of related items. In our case, when writing software, it is a collection of files related to a software project. You can imagine it as a project folder with all the relevant files inside of it. In fact, that's what it will look like on your computer anyways. Sometimes they're called 'repos' for short.": "Un {/str/}dépôt ('repository' en anglais){/str_e/} est un ensemble d'éléments liés. Dans notre cas, l'écriture de logiciels, c'est une collection de fichiers liés à un projet. Vous pouvez l'imaginer comme un dossier de projet avec tous les éléments pertinents à l'intérieur de celui-ci. En fait, c'est ce à quoi il ressemblera sur votre ordinateur. Dans la littérature (et aussi dans la suite de ce guide) vous trouverez aussi les appellations \"Référentiel\", \"Repositorie\" ou plus simplement \"Repo\" pour parler de dépôt",
  "You tell Git what your project is and Git will start tracking all of the changes to that folder. This makes it a Git repository: a folder of items being tracked by Git. Git tracks when files are added, subtracted or even a single letter in a single file is changed. All of this plus who did it and when is tracked by Git. In software, tracking changes like this is called {/str/}version control{/str_e/}.": "Vous dites à Git quel est votre projet et Git va commencer à suivre toutes les modifications apportées à ce dossier. Cela en fait un dépôt Git: un dossier suivi par Git. Git suit lorsque les fichiers sont ajoutés, soustraits ou même modifiée (que ce soit d'une seule lettre ou en intégralité). En plus de cela Git suit qui a apporté ces modifications. Dans l'univers du développement logiciel, ce suivi des modifications s'appellent la {/str/}gestion de version{/str_e/}.",
  "Using Terminal": "Utilisation du terminal",
  "{/str/}Terminal{/str_e/} (or Bash) is a way to instruct your computer to do things by typing commands rather than clicking applications with your mouse. You can rename files, open files, create new folders, move between directories (folders) and more all by running typed commands. You can even use a text editor for code (like {/lnk_vim/}Vim{/lnk_e/}) in your terminal an never have to leave!": "{/str/}Terminal(ou Bash){/str_e/} est un moyen pour indiquer à votre ordinateur de faire des choses en tapant des commandes plutôt que de cliquer sur les applications avec votre souris. Vous pouvez renommer des fichiers, ouvrir des fichiers, créer de nouveaux dossiers, changer de répertoires et plus simplement en exécutant des commandes textuelle. Vous pouvez même utiliser un éditeur de texte adapté au code (comme {/lnk_vim/}Vim{/lnk_e/}) pour ne plus jamais avoir besoin de quitter votre console!",
  "Besides navigating your computer, you can also use programs in Terminal that have a {/str/}command-line interface (CLI){/str_e/}, meaning they can be run with commands in terminal. Git is one of these. The first part of the command lets your computer know you're talking to Git. The parts following that are the commands and the different options you want Git to act on.": "En plus de naviguer sur votre ordinateur, vous pouvez également utiliser des programmes qui ont une interface en {/str/}ligne de commande(CLI){/str_e/}. Cela signifie qu'ils peuvent être utilisés à partir de commandes lancées dans un terminal. Git est l'un d'entre eux ! La première partie de la commande permet à votre ordinateur de savoir que vous parlez à Git. Les parties qui suivent sont les commandes et les différentes options que vous souhaitez passer à Git.",
  "In Git-it you'll learn a few basic command-line actions (in addition to Git commands) for navigating your computer. They're described within the steps.": "Dans Git-it, vous apprendrez quelques actions de base de la ligne de commande (en plus des commandes Git) pour naviguer sur votre ordinateur; Elles sont décrites au fur et à mesure des étapes.",
  "Create a Repository": "Créer un Dépôt",
  "You're going to create a new project folder and then initialize it as a Git repository. We'll name the folder 'hello-world' in this challenge, but you can choose a different name if you already have a folder named this (it's a common first project name).": "Vous allez créer un nouveau dossier de projet puis l'initialiser en tant que dépôt Git. Nommer le dossier 'hello-world' dans ce défi, vous pouvez choisir un nom différent si vous avez déjà un dossier nommé ainsi (c'est un nom commun en informatique).",
  "Time to open your terminal!": "Maintenant ouvrez votre terminal!",
  "In your terminal window, type these commands, one at a time, pressing enter/return after each.": "Dans la fenêtre de votre terminal, tapez ces commandes, une à la fois, en appuyant sur la touche \"Entrée\" pour valider votre saisie",
  "First, make a new folder:": "Tout d'abord, créez un nouveau dossier:",
  "Tip: mkdir stands for {/em/}make directory{/em_e/}": "Astuce: mkdir signifie {/em/}make directory{/em_e/} (créer un dossier)",
  "Then go into that folder:": "Ensuite, entrez dans ce dossier:",
  "Tip: cd stands for {/em/}change directory{/em_e/}": "Astuce: cd signifie {/em/}change directory{/em_e/} (changer de dossier)",
  "Finally, tell Git to initialize (start tracking) the folder you are now in:": "Enfin, dites à Git d'initialiser(démarrer le suivi) du dossier dans lequel vous êtes:",
  "The last command should return something starting with 'Initialized empty Git repository'. The others commands do not return anything.": "La dernière commande devrait renvoyer quelque chose commençant par \"Initialized empty Git repository\" (ou \"Dépôt Git vide initialisé\" si vous avez une version de git en français). Les autres commandes ne renvoie rien.",
  "You did it! If you want to be double-sure that it's a Git repository, type {/cde/}git status{/cde_e/} and if it doesn't return 'fatal: Not a git repository...', you're golden!": "Vous l'avez fait! Si vous voulez être sûr que c'est un dépôt Git, tapez {/cde/}git status{/cde_e/} et s'il ne vous retourne pas 'fatal: Not a git repository...' (ou \"fatal: ni ceci ni aucun de ses répertoires parents n'est un dépôt git\") c'est que tout est parfait !",
  "Make a new folder (aka make directory)": "Créer un nouveau dossier (aka make directory)",
  "Navigate into an existing folder (aka change directory)": "Naviguer dans un dossier existant (aka change directory)",
  "List the items in a folder": "Lister les éléments dans un dossier",
  "Turn Git on for a folder": "Activez Git pour un repertoire"
}
