{
  "Create a GitHub account and add your username to your Git config.": "Créez un compte GitHub et ajoutez votre nom d'utilisateur à votre configuration Git.",
  "Working Better, Together": "Working Better, Together",
  "The repository you've created so far is just on your computer, which is handy, but makes it pretty hard to share and work on with others. No worries, that's what GitHub is for!": "Le dépôt que vous avez créé jusqu'à présent est juste sur votre ordinateur, ce qui est pratique, mais il est très difficile de le partager pour travailler avec d'autres. Pas de soucis, c'est ce à quoi GitHub est destiné!",
  "GitHub is a website that allows people everywhere to upload what they're working on with Git so that everyone can easily work together on the same project. GitHub which acts as the central repository for you and everyone else to share. You push your changes to it and pull down changes from others.": "GitHub est un site Web qui permet aux personnes de partager leur travail grâce à Git. Tout le monde pourra ainsi travailler ensemble sur le même projet. GitHub est un dépôt central pour vous et tous vos potentiels collaborateurs. Dans ce dépôt vous pourrez y pousser vos modifications et aussi y récupérer celles des autres.",
  "Create a GitHub Account": "Créer un compte GitHub",
  "Visit {/lnk_github/}github.com{/lnk_e/} and sign up for a free account. {/str/}High five, welcome!{/str_e/}": "Visitez {/lnk_github/}github.com{/lnk_e/} et inscrivez-vous pour un compte gratuit. {/str/}Félicitation et bienvenue chez les githubers!{/str_e/}",
  "Add GitHub username to Git": "Ajouter le nom d'utilisateur GitHub à Git",
  "Add your GitHub username to your Git configuration. We'll do this just for the sake of Git-it{/smc/} it makes it easier to verify the upcoming challenges. Save it exactly as you created it on GitHub and {/str/}capitalize where capitalized{/str_e/}. Note, you don't need to enter the {/dqm/}{/lt/}{/dqm/} and {/dqm/}{/gt/}{/dqm/}.": "Ajoutez votre nom d'utilisateur GitHub à votre configuration Git. Nous le faisons pour l'amour de Git-it{/smc/} Cela facilite la vérification des défis à venir. Enregistrez-le exactement comme vous l'avez créé sur GitHub avec {/str/}les mêmes majuscules et minuscules{/str_e/}. Notez que vous n'avez pas besoin d'entrer le {/dqm/}{/lt/}{/dqm/} et {/dqm/}{/gt/}{/dqm/}.",
  "Add your GitHub username to your Git configuration:": "Ajoutez votre nom d'utilisateur GitHub à votre configuration Git:",
  "You can double check what you have set in your Git config by typing:": "Vous pouvez vérifier ce que vous avez configuré dans Git en tapant:",
  "Make sure you type {/cde/}user.username{/cde_e/} above and not {/cde/}user.name{/cde_e/}, which would override the name you set in the first challenge and leave you with no username property! If you found you did that, it's ok, just repeat the step in the first challenge to add your name and then complete the step above.": "Assurez-vous de taper {/cde/}user.username{/cde_e/} et non {/cde/}user.name{/cde_e/}, qui remplacerait le nom que vous configuré dans le premier défi et vous laisserait sans une attribution correcte de vos contributions! Si vous vous êtes trompé, rien de grave, il faudra simplement répéter la configuration du premier premier défi pour ajouter votre nom.",
  "GitHub & Git config usernames do not match": "Les noms d'utilisateur GitHub & Git ne correspondent pas.",
  "A common error is not having your GitHub username match the case of the one you set with {/cde/}git config{/cde_e/}. For instance, 'JLord' isn't the same as 'jlord'": "Une erreur de capitalisation peut faire que votre nom d'utilisateur GitHub correspond au cas de celui que vous avez défini avec la commande {/cde/}git config{/cde_e/}. Par exemple, 'JLord' n'est pas le même que 'jlord'",
  "To change your username set with Git, just do the same command you did earlier, but with the correct capitalization:": "Pour changer votre nom d'utilisateur Git, il suffit de faire la même commande que précédemment, mais avec la bonne capitalisation:",
  "When you've made your updates, verify again!": "Lorsque vous avez effectué la mises à jour de votre configuration, vérifiez à nouveau!"
}
