{
  "Add a branch, locally, to your forked repository to work on your changes.": "Ajoutez une branche, localement, à votre dépôt forké pour travailler sur vos modifications.",
  "Branches": "Branches",
  "Git repositories use branches to isolate work when needed. It's common practice when working on a project or with others on a project to create a {/str/}branch{/str_e/} to keep your working changes in. This way you can do your work while the main, commonly named 'master', branch stays stable. When the work on your branch is finished you merge it back into the 'master' master branch.": "Les dépôts Git utilisent des branches pour isoler le travail au besoin. C'est une pratique courante lorsque vous travaillez sur un projet de créer une {/str/}branche{/str_e/} pour que vos modifications de travail soient conservée à part. De cette façon, vous pouvez faire votre travail, tandis que la branche principale, généralement nommée «master», reste stable. Lorsque le travail sur votre branche est terminé vous le fusionnez dans la branche principale 'master'.",
  "The diagram below shows how you can branch off of your 'master' branch, do work and then merge those changes back into 'master'. You can even branch off of a branch if you need to, the 'master' branch doesn't have to be the base.": "Le schéma ci-dessous montre comment vous pouvez dériver de votre branche 'master', travailler et fusionner ces modifications dans «master». Vous pouvez même dériver d'une autre branche si vous le souhaitez, la branche 'master' n'a pas à être la base d'un embranchement.",
  "For a great visualization on how branches work in a project, see this GitHub Guide: {/lnk_guide/}guides.github.com/overviews/flow{/lnk_e/}": "Pour une excellente visualisation sur la façon dont les branches fonctionnent dans un projet, consultez ce guide GitHub: {/lnk_guide/}guides.github.com/overviews/flow{/lnk_e/}",
  "GitHub Pages": "GitHub Pages",
  "GitHub will automatically serve and host static website files in branches named 'gh-pages'. This free service is called {/lnk_pages/}GitHub Pages{/lnk_e/}. Since the project you forked creates a website, its main branch is named 'gh-pages' instead of 'master'. All repositories that have a 'gh-pages' branch with website files can be found, live online, using this pattern for the URL:": "GitHub hébergera automatiquement les fichiers de sites statiques. Pour être accessible comme un site web, il doivent être situées dans la branche nommée 'gh-pages'. Ce service gratuit est appelé {/lnk_pages/}GitHub Pages{/lnk_e/}. Puisque le projet que vous avez lancé crée un site Web, la branche principale sera 'gh-pages' au lieu de 'master'. Tous les dépôt qui ont une branche 'gh-pages' ont un site Web directement accessible en ligne, se situant à l'URL construite sur le modèle suivant:",
  "Create a branch": "Créer une branche",
  "When you create a branch, Git copies everything from the current branch you're on and places it in the branch you've requested be made.": "Lorsque vous créez une branche, Git copie l'intégralité de la branche sur laquelle vous vous trouvez et la place dans la branche nouvellement crée.",
  "While still inside of your local 'patchwork' repository, type {/cde/}git status{/cde_e/} to see what branch you're currently on. Git should reply that you're on the 'gh-pages' branch.": "Toujours dans votre dépôt local 'patchwork', tapez {/cde/}git status{/cde_e/} pour voir sur quelle branche vous êtes. Git devrait répondre que vous êtes sur la branche 'gh-pages'.",
  "Now create a new branch and name it {/add_branch/}, where 'username' is your username. For instance, {/add_jlord/}. {/str/}Branches are case-sensitive so name your branch exactly the way your GitHub name appears{/str_e/}.": "Créez maintenant une nouvelle branche et nommez-la {/add_branch/}, où 'username' est votre nom d'utilisateur. Par exemple, {/add_jlord/}. {/str/}Les branches sont sensibles à la casse, nommez-là exactement avec la même capitalisation que votre compte GitHub.{/str_e/}",
  "Now you have a branch with a new name that is identical to 'gh-pages'.": "Maintenant, vous avez une branche avec un nouveau nom identique à 'gh-pages'.",
  "To go into that branch and work on it you {/str/}checkout{/str_e/} a branch. Go on your new branch:": "Pour entrer dans une branche et travailler dessus, vous devez {/str/}checkout{/str_e/} cette branche. Allez sur votre nouvelle branche:",
  "Step: Create a new file": "Étape: Créer un nouveau fichier",
  "Back in your text editor:": "Retour dans votre éditeur de texte:",
  "Create a new file named {/filename_add/}, where 'username' is your username. For instance, {/filename_jlord/}.": "Créez un nouveau fichier nommé {/filename_add/}, où 'username' est votre nom d'utilisateur. Par exemple, {/filename_jlord/}.",
  "Then, just write your GitHub username in it, that's it and that's all. For instance, I'd type 'jlord'.": "Écrivez simplement votre nom d'utilisateur GitHub et c'est tout. Par exemple, je taperez 'jlord'.",
  "Save this file in the 'contributors' folder in Patchwork: {/str/}{/filepath/}{/str_e/}": "Enregistrez ce fichier dans le dossier 'contributors' de Patchwork: {/str/}{/filepath/}{/str_e/}",
  "Next, check in your changes (see below).": "Vérifiez vos modifications (voir ci-dessous).",
  "Check-in": "Check-in",
  "Go through the steps for checking in a project: ": "Effectuez les étapes ci-après pour vérifier un projet:",
  "Now push your update to {/str/}your fork{/str_e/}, 'origin', on GitHub:": "Maintenant vous pouvez pousser vos modifications sur {/str/}votre fork{/str_e/}, avec le remote 'origin', sur GitHub:",
  "Permission denied...error: 403": "Permission denied...error: 403",
  "You are pushing changes to a repository you don't have write access to. In this case, you're likely pushing to the original 'jlord/patchwork'. Make sure that you're pushing to 'origin' and that it points to your fork's address on GitHub. To check and see what your remotes are and where they point run {/cde/}git remote -v{/cde_e/}. You should have 'upstream' pointing to 'jlord/patchwork' and 'origin' pointing to 'yourusername/patchwork'.": "Vous essayer de pousser des modifications à un référentiel auquel vous n'avez pas accès en écriture. Dans ce cas, vous poussez probablement sur le dépôt original 'jlord/patchwork'. Assurez-vous que avez bien poussé sur le remote 'origin' et qu'il pointe bien vers l'adresse de votre fork sur GitHub. Pour vérifier et voir quels sont les remotes et où ils pointent, exécutez {/cde/}git remote -v{/cde_e/}. Vous devriez avoir 'upstream' indiquant 'jlord/patchwork' et 'origin' indiquant 'yourusername/patchwork'",
  "To fix a remote that is pointing to the wrong place you can re-set its url: {/cde/}git remote set-url origin {/lt/}URLTOYOURFORK{/gt/}{/cde_e/}.": "Pour réparer un remote qui pointe vers le mauvais endroit, vous pouvez redéfinir son URL: {/cde/}git remote set-url origin {/lt/}URLTOYOURFORK{/gt/}{/cde_e/}.",
  "Authentication failed...error: 401": "Authentication failed...error: 401",
  "Your identity could not be verified. You may have 2FA (Two Factor Authentication) turned on in which case you must use a personal access token as your password. You can generate one by {/lnk_instr/}following these instructions{/lnk_e/}. You'll need to keep this and use it in place of your password when prompted. You can also {/lnk_save/}save this access token{/lnk_e/} on your computer so that you don't have to re-enter it.": "Votre identité n'a pas pu être vérifiée. Vous avez peut-être activé 2FA (Two Factor Authentication) auquel cas vous devez utiliser un jeton d'accès personnel comme mot de passe. Vous pouvez en générer un en {/lnk_instr/}suivant ces instructions{/lnk_e/}. Vous devrez le garder et l'utiliser à la place de votre mot de passe lorsque vous y êtes invité. Vous pouvez également {/lnk_save/}enregistrer ce jeton d'accès{/lnk_e/} sur votre ordinateur afin de ne plus avoir à le saisir.",
  "File NOT in contributors folder": "File NOT in contributors folder",
  "The file you create should be placed inside the existing 'contributors' folder in the Patchwork repository. If you put it somewhere else, simply use Finder or Windows Explorer to move your file into the folder. You can check {/cde/}git status{/cde_e/} again and you'll find it sees your changes. Stage and then commit all of these changes (additions and deletions) with the commands below.": "Le fichier que vous créez doit être placé dans le dossier 'contributors' du référentiel Patchwork. Si vous l'avez mis ailleurs, déplacez votre fichier dans le dossier. Vous pouvez vérifiez à nouveau {/cde/}git status{/cde_e/} et vous verrez vos modifications. Ajoutez et soumettez (commit) toutes (-A) les modifications (ajouts et suppressions) avec les commandes ci-dessous.",
  "Branch name expected: _____": "Branch name expected: _____",
  "The branch name should match your user name exactly. To change your branch name:": "Le nom de la branche doit correspondre exactement à votre nom d'utilisateur. Pour changer votre nom de branche:",
  "When you've made your updates, verify again!": "Lorsque vous avez effectué la mises à jour de votre configuration, vérifiez à nouveau!",
  "You can create and switch to a branch in one line": "Vous pouvez créer et passer sur une branche en une seule commande",
  "Create a new branch": "Créer une nouvelle branche",
  "Move onto a branch": "Se déplacer sur une branche",
  "List the branches": "Lister les branches",
  "Rename a branch you're currently on": "Renommer la branche courante",
  "Verify what branch you're working on": "Vérifiez la branche sur laquelle vous travaillez"
}
