{
  "Merge your branch locally, delete the branch and pull from upstream.": "Scalanie gałęzi lokalnie, usuwanie gałęzi i pobieranie z repozytorium oryginalnego.",
  "Cleaning up": "Sprzątanie",
  "Once you don't need branches anymore you can delete them locally and remotely. This is helpful so that you don't end up with a pile of old branches.": "Kiedy gałęzie nie są Ci już potrzebne możesz usunąć je z repozytorium lokalnego i zdalnego. Jest to pomocne, gdyż repozytorium nie zostaje zaśmiecone starymi gałęziami.",
  "Merge Locally": "Scalanie lokalni",
  "Your pull request has been merged! Your branch was merged into the 'gh-pages' branch of the original on GitHub. You can merge your branch locally, too.": "Twój pull request został scalony! Twoja gałąź została scalona do gałęzi 'gh-pages' w oryginalnym repozytorium na GitHubie. Możesz również scalić swoją gałąź lokalnie.",
  "First, move into the branch you want to merge into — in this case, the branch 'gh-pages'.": "Najpierw, przejdź na gałąź do której chcesz scalać — w tym wypadku będzie to gałąź 'gh-pages'.",
  "Now tell Git what branch you want to merge in — in this case, your feature branch that begins with {/dqm/}add-{/dqm/}.": "Teraz poinstruuj Gita którą gałąź chcesz scalić — w tym wypadku będzie to gałąź, której nazwa zaczyna się od {/dqm/}add-{/dqm/}.",
  "Tidy up by deleting your feature branch. Now that it has been merged you don't really need it around.": "Posprzątaj po sobie usuwając scaloną już gałąź. Gdy została scalona nie będzie już więcej potrzebna.",
  "You can also delete the branch from your remote on GitHub:": "Możesz również usunąć gałąź z Twojego repozytorium zdalnego na GitHubie:",
  "Pull from Upstream": "Pobieranie z repozytorium oryginalnego",
  "And last but not least, the original has changed since your pull request was merged — Reporobot added your name to the website! If you pull in these changes from upstream you'll be up to date and have that version too. You can actually see it live as well at: yourusername.github.io/patchwork.": "Ostatnią, ale nie mniej ważną informacją jest fakt, że oryginalne repozytorium zmieniło się ponieważ Twój pull request został zaakceptowany — Reporobot dodał Twoją nazwę do strony! Jeśli pobierzesz te zmiany z repozytorium oryginalnego będziesz posiadał aktualną kopię repozytorium. Możesz również zobaczyć ją na żywo pod adresem: twojanazwaużytkownika.github.io/patchwork.",
  "To pull from the original upstream:": "Aby pobrać zmiany z oryginalnego repozytorium:",
  "Congratulations!": "Gratulacje!",
  "You've created local repositories, remote repositories, worked with a collaborator, pushed, pulled and joined the millions of others developing and enriching open source!": "Tworzyłeś lokalne repozytoria, zdalne repozytoria, pracowałeś ze współpracownikiem, wypychałeś, pobierałeś i dołączyłeś do milionów innych ludzi programujących i wzbogacających świat open source!",
  "Visit {/lnk_patchwork/}jlord.github.io/patchwork{/lnk_e/} to see your name incorporated! Looking to keep going? Checkout the {/lnk_next/}What Next{/lnk_e/} section on the resources page in this app.": "Odwiedź {/lnk_patchwork/}jlord.github.io/patchwork{/lnk_e/} by zobaczyć swój nick w tym gronie!  Nie chcesz zwalniać tempa? Sprawdź sekcję {/lnk_next/}Co dalej?{/lnk_e/} na stronie z zasobami do nauki w tej aplikacji.",
  "Merge a branch into current branch": "Scalanie gałęzi do aktywnej gałęzi",
  "Change the branch you're working on": "Zmiana aktywnej gałęzi",
  "Delete a local branch": "Usuwanie gałęzi lokalnej",
  "Delete a remote branch": "Usuwanie gałęzi zdalnej",
  "Pull from a remote branch": "Pobieranie z gałęzi zdalnej"
}
